class ahadit {
  final String hadit, mosnad, hokm;
  ahadit({required this.hadit, required this.mosnad, required this.hokm});
}

List<ahadit> di9Sadr = [
  ahadit(
      hadit:
          " قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : ' مَا أَصَابَ أَحَدًا قَطُّ هَمٌّ، وَلَا حَزَنٌ، فَقَالَ : اللَّهُمَّ إِنِّي عَبْدُكَ، ابْنُ عَبْدِكَ، ابْنُ أَمَتِكَ، نَاصِيَتِي بِيَدِكَ، مَاضٍ فِيَّ حُكْمُكَ، عَدْلٌ فِيَّ قَضَاؤُكَ، أَسْأَلُكَ بِكُلِّ اسْمٍ هُوَ لَكَ ؛ سَمَّيْتَ بِهِ نَفْسَكَ، أَوْ عَلَّمْتَهُ أَحَدًا مِنْ خَلْقِكَ، أَوْ أَنْزَلْتَهُ فِي كِتَابِكَ، أَوِ اسْتَأْثَرْتَ بِهِ فِي عِلْمِ الْغَيْبِ عِنْدَكَ أَنْ تَجْعَلَ الْقُرْآنَ رَبِيعَ قَلْبِي، وَنُورَ صَدْرِي، وَجِلَاءَ حُزْنِي، وَذَهَابَ هَمِّي إِلَّا أَذْهَبَ اللَّهُ هَمَّهُ وَحُزْنَهُ، وَأَبْدَلَهُ مَكَانَهُ فَرَحًا '",
      mosnad:
          "مرفوع | حديث رقم :3712 | مجلد رقم :6 | صفحة رقم : 246 \n مسند عبد الله بن مسعود",
      hokm: "حكم الحديث | إسناده ضعيف"),
  ahadit(
      hadit:
          "'اللَّهُمَّ إِنِّيْ أَسْأَلُكَ سَلاَماً مَا بَعْدَهُ كَدَرْ ، وَرِضَى مَا بَعْدَهُ سَخَطْ، وَفَرَحاً مَا بَعْدَهُ حُزْنْ ، اللَّهُمَّ اِمْلَأْ قَلْبِيْ بِكُلِّ مَا فِيْهِ الْخَيْرُ لِي، اللَّهُمَّ اجْعَلْ طَرِيقِي مُسَهَّلاً وَأَيَّامِي الْقَادِمَةَ أَفْضَلَ مِنْ سَابِقَاتِهَا .. يَا لَطِيفُ، يَا لَطِيفُ،أَلْطِفْ بِي بِلُطْفِكَ الْخَفِي، وَأَعِنِّي بِقُدْرَتِكَ، اللَّهُمَّ إِنِّي أَنْتَظِرُ فَرَجَكَ، وَأُرَقِّبُ لُطْفَكَ، فَالْطُفْ بِي'",
      mosnad: "",
      hokm: ""),
  ahadit(
      hadit:
          "قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : ' اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْهَمِّ وَالْحَزَنِ، وَالْعَجْزِ وَالْكَسَلِ، وَالْبُخْلِ وَالْجُبْنِ، وَضَلَعِ الدَّيْنِ وَغَلَبَةِ الرِّجَالِ'",
      mosnad: "مرفوع | حديث رقم : 2893 | مجلد رقم: 4 | صفحة رقم : 36",
      hokm: "كتاب الجهاد واليسر - باب من غزا\n بصبي للخدمة"),
  ahadit(
      hadit:
          "قَالَ تَعَالَى  << أَمَّن يُجِيبُ الْمُضْطَرَّ إِذَا دَعَاهُ وَيَكْشِفُ السُّوءَ وَيَجْعَلُكُمْ خُلَفَاءَ الْأَرْضِ ۗ أَإِلَٰهٌ مَّعَ اللَّهِ ۚ قَلِيلًا مَّا تَذَكَّرُونَ >>",
      mosnad: "سورة النمل",
      hokm: "الآية 62"),
  ahadit(
      hadit:
          "دعوات سمَّاها النبي صلى الله عليه وسلم دعوات المكروب  'اللهُمَّ رحمتَكَ أرجُو، فلا تَكِلْني إلى نفسِي طَرْفةَ عَيْنٍ، وأصلِحْ لِي شأني كُلَّهُ، لا إلهَ إلَّا أنتَ' ",
      mosnad: "سنن أبي داود 5090، انظر: صحيح الجامع: 3388.",
      hokm: ""),
  ahadit(
      hadit:
          " ' لَا إِلهَ إلَّا أَنتَ، سُبْحانَكَ إِنِّي كُنتُ مِنَ الظَّالِمِينَ '  حيث قال رسول الله صلى الله عليه وسلم عن هذا الدعاء: ' أَلَا أُخْبِرُكُمْ بشيءٍ إذا نزلَ برجلٍ منكم كَرْبٌ، أو بَلاءٌ مِنْ أمرِ الدنيا، دعا بِهِ فَفَرَّجَ عنه؟ دُعاءُ ذي النونِ ' ",
      mosnad: " صحيح الجامع، الألباني: 2605 ",
      hokm: ""),
  ahadit(
      hadit:
          " 'كَانَ رَسُولُ اللَّهُ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمْ يَدْعُو بِهَؤُلاَءِ الْكَلِمَاتِ وَيُعَظِّمُهُنْ  : ' اللَّهُمَّ فَارِجَ الْهَمِّ ، وَكَاشِفَ الْكُرَبِ ، وَمُجِيبَ الْمُضْطَرِّينَ ، وَرَحْمَنَ الدُّنْيَا وَالآخِرَة وَرَحِيمَهُمَا ، ارْحَمْنِي الْيَوْمَ رَحْمَةً وَاسِعَة تُغْنِينِي بِهَا عَنْ رَحْمَةِ مَنْ سِوَاك ' ",
      mosnad: " رواه ابن أبي شيبة في ' المصنف '(6/109) ",
      hokm: "مرسل | ضعيف"),
  ahadit(
      hadit:
          " ' ثبت عنه ﷺ أنه كان إذا حزبه أمر، يقول: 'لا إله إلا الله العظيم الحليم، لا إله إلا الله رب العرش الكريم، لا إله إلا الله رب السماوات والأرض، ورب العرش العظيم' هذا دعاء الكرب، ويدعو بعد ذلك بما يهمه، وكان يستعين بالصبر والصلاة، إذا حزبه أمر؛ فزع إلى الصلاة، وصلى ما تيسر -عليه الصلاة والسلام- عملًا بقول الله -جل وعلا-: <<وَاسْتَعِينُوا بِالصَّبْرِ وَالصَّلاةِ>> ' ",
      mosnad: "",
      hokm: " "),
  ahadit(
    hadit:
        "قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : ' دَعْوَةُ ذِي النُّونِ - إِذْ دَعَا، وَهُوَ فِي بَطْنِ الْحُوتِ - : لَا إِلَهَ إِلَّا أَنْتَ سُبْحَانَكَ إِنِّي كُنْتُ مِنَ الظَّالِمِينَ ؛ فَإِنَّهُ لَمْ يَدْعُ بِهَا رَجُلٌ مُسْلِمٌ فِي شَيْءٍ قَطُّ إِلَّا اسْتَجَابَ اللَّهُ لَهُ '",
    mosnad: " مرفوع | حديث رقم : 3505 | مجلد رقم : 5 | صفحة رقم : 484",
    hokm: " ",
  ),
];

List<ahadit> hozn = [
  ahadit(
    hadit:
        " 'يا ودود، يا ودود، يا ودود، يا ذا العرشِ المجيد، يا مُبدئ يا معيد، يا فعال لما يريد، أسألك بنور وجهك الذي ملأ أركان عرشك، وأسألك بقدرتك التي قدرت بها على جميع خلقك، وأسألك برحمتك التي وسعت كل شيء، لا إله إلا أنت، يا مُغيث أغثني، يا حي يا قيوم، يا نور يا قدوس، يا حي يا الله، يا رحمن اغفر لي الذنوب التي تحل النقم، واغفر لي الذنوب التي تُورث الندم، واغفر لي الذنوب التي تحبس القِسم، واغفر لي الذنوب التي تهتِك العِصم، واغفر لي الذنوب التي تقطع الرجاء، واغفر لي الذنوب التي تُعجّل الفناء، واغفر لي الذنوب التي ترد الدعاء، واغفر لي الذنوب التي تمسك غيث السماء، واغفر لي الذنوب التي تُظلم الهواء، واغفر لي الذنوب التي تكشِف الغِطاء، اللهم إني أسألك، يا فارج الهم، يا كاشف الغم، مجيب دعوة المضطر، رحمن الدنيا والآخرة ورحيمها، أسألك أن ترحمني برحمةٍ من عندك تُغنني بها عن رحمة من سواك ",
    mosnad: "",
    hokm: "",
  ),
  ahadit(
    hadit:
        " 'اللهم إن ضرورتنا قد حَفت، وليس لها إلا أنت، فاكشفها، يا مفرج الهموم، لا إله إلا أنت سبحانك، إني كنت من الظالمين، اللهم اكفني ما أهمني، اللهم يا حابس يد إبراهيم عن ذبح ابنه، يا رافع شأن يوسف على أخوته وأهله، يا من راح عبرة داود، وكاشف ضُر أيوب، يا مُجيب دعوة المضطرين، وكاشف غم المغمومين، أسألك أن تفرج همي، يا فارج الغم، اجعل لي من أمري فرجًا ومخرجًا، يا سامع كل شكوى، وكاشف كل كرب، أدعوك يا إلهي دعاء من اشتدت به فاقته، وضعفت قوته، وقلت حيلته، دعاء الملهوف المكروب الذي لا يجد كشف ما نزل به إلا منك، فرج عني ما أهمني، وتولى أمري بلُطفك، وتداركني برحمتك وكرمك، إنك على كل شيء قدير' ",
    mosnad: "",
    hokm: "",
  ),
  ahadit(
      hadit:
          "قال الله تعالى: ' الَّذِينَ آمَنُوا وَتَطْمَئِنُّ قُلُوبُهُمْ بِذِكْرِ اللَّهِ أَلَا بِذِكْرِ اللَّهِ تَطْمَئِنُّ الْقُلُوبُ الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ طُوبَى لَهُمْ وَحُسْنُ مَآبٍ ' ",
      mosnad: " الآية : 28- 29 ",
      hokm: " الرعد "),
  ahadit(
    hadit:
        "لا تَحزَن إِنَّ اللَّـهَ معنا \n \n قال تعالى ' إِلَّا تَنصُرُوهُ فَقَدْ نَصَرَهُ اللَّهُ إِذْ أَخْرَجَهُ الَّذِينَ كَفَرُوا ثَانِيَ اثْنَيْنِ إِذْ هُمَا فِي الْغَارِ إِذْ يَقُولُ لِصَاحِبِهِ لَا تَحْزَنْ إِنَّ اللَّهَ مَعَنَا ۖ فَأَنزَلَ اللَّهُ سَكِينَتَهُ عَلَيْهِ وَأَيَّدَهُ بِجُنُودٍ لَّمْ تَرَوْهَا وَجَعَلَ كَلِمَةَ الَّذِينَ كَفَرُوا السُّفْلَىٰ ۗ وَكَلِمَةُ اللَّهِ هِيَ الْعُلْيَا ۗ وَاللَّهُ عَزِيزٌ حَكِيمٌ ' ",
    mosnad: " الآية : 30",
    hokm: " التوبة ",
  ),
  ahadit(
    hadit:
        "اللهمّ إنّي أسألك باسمك العظيم الأعظم الّذي إذا دعيت به أجبت وإذا سألت به أعطيت، وإذا استرحمت به رحمت، وإذا استفرجت به فرجت أن تفرّج عنّي ما أنا فيه وأن تكفيني شرّ الحاسدين والمعادين، وانصرني عليهم بنصرك وتأييدك يا قويّ يا معين ",
    mosnad: "",
    hokm: "",
  ),
  ahadit(
    hadit:
        " ربّنا أفرغ علينا صبرًا وتوفّنا مسلمين وألحقنا بالصّالحين وأفوّض أمري إلى الله، إنّ الله بصير بالعباد وحسبنا الله ونعم الوكيل، ولا حول ولا قوّة إلّا بالله العليّ العظيم، وصلّى الله على سيّدنا محمّد الحبيب وعلى آله وصحبه وسلّم. اللهم إنا نسألك باسمك الذي فزعت الجن من مخافته، وتزلزلت الأقدام من سطوته، و خرست الافواة من عزته و اقشعرت الجلود من هيبته يا علام الغيوب ما أسرع اسمك في تفريج الكروب يا الله يا الله يا الله أنت لها ولكل هم وغم وضيق وشدة. أقول مستغيثا بك في أموري كلها يا لطيف يا لطيف يا لطيف، وصلى الله على سيدنا محمد وعلى اله وصحبه وسلم ",
    mosnad: "",
    hokm: "",
  ),
  ahadit(
    hadit:
        " اسألك بكلّ اسمٍ هو لك سمّيت به نفسك، أو أنزلته فى كتابك، أو علّمته أحدًا من خلقك، أو استأثرت به في علم الغيب عندك أن تجعل القرآن العظيم ربيع قلبي، ونور صدري، وجلاء حزني، وذهاب همّي وغمّي. واغنني عن كلّ أحد، يا من إليه المستند، وعليه المعتمد، وهو الواحد الفرد الصّمد، لا شريك له ولا ولد، خذ بيدي من الضّلال إلى الرّشد، ونجّني من كلّ ضيقٍ ونكد ",
    mosnad: "",
    hokm: "",
  ),
  ahadit(
    hadit:
        "  عَنْ عَائِشَةَ رضي الله عنها، أَنَّ النَّبِيَّ صلى الله عليه وسلم جَمَعَ أَهْلَ بَيْتِهِ، فَقَالَ: ' إِذَا أَصَابَ أَحَدَكُمْ غَمٌّ أَوْ كَرْبٌ، فَلْيَقُلِ: اللَّهُ اللَّهُ رَبِّي، لَا أُشْرِكُ بِهِ شَيْئًا '  ",
    mosnad: "راوي الحديث  :  أسماء بنت عميس \n الكتاب : سنن أبي داود ",
    hokm: " حكم الحديث : صحيح ",
  ),
  ahadit(
    hadit:
        " قال رسول الله صلى الله عليه وسلم : ' اللَّهُمَّ بِعِلْمِكَ الْغَيْبَ وَقُدْرَتِكَ عَلَى الْخَلْقِ ؛ أَحْيِنِي مَا عَلِمْتَ الْحَيَاةَ خَيْرًا لِي، وَتَوَفَّنِي إِذَا عَلِمْتَ الْوَفَاةَ خَيْرًا لِي، اللَّهُمَّ وَأَسْأَلُكَ خَشْيَتَكَ فِي الْغَيْبِ وَالشَّهَادَةِ، وَأَسْأَلُكَ كَلِمَةَ الْحَقِّ فِي الرِّضَا وَالْغَضَبِ، وَأَسْأَلُكَ الْقَصْدَ فِي الْفَقْرِ وَالْغِنَى، وَأَسْأَلُكَ نَعِيمًا لَا يَنْفَدُ، وَأَسْأَلُكَ قُرَّةَ عَيْنٍ لَا تَنْقَطِعُ، وَأَسْأَلُكَ الرِّضَاءَ بَعْدَ الْقَضَاءِ، وَأَسْأَلُكَ بَرْدَ الْعَيْشِ بَعْدَ الْمَوْتِ، وَأَسْأَلُكَ لَذَّةَ النَّظَرِ إِلَى وَجْهِكَ وَالشَّوْقَ إِلَى لِقَائِكَ فِي غَيْرِ ضَرَّاءَ مُضِرَّةٍ وَلَا فِتْنَةٍ مُضِلَّةٍ، اللَّهُمَّ زَيِّنَّا بِزِينَةِ الْإِيمَانِ، وَاجْعَلْنَا هُدَاةً مُهْتَدِينَ ' ",
    mosnad:
        " مرفوع |  حديث رقم : 1305 |  مجلد رقم : 3 \n صفحة رقم : 54  كتاب السهو - نوع آخر ",
    hokm: "حكم الحديث : صحيح",
  ),
  ahadit(
    hadit:
        " قال رسول الله صلى الله عليه وآله وسلم قال: ' اللهم لا سهلَ إلا ما جعلتَه سهلاً، وأنت تجعل الحزنَ إذاشئتَ سهلاً ' ",
    mosnad:
        " أخرجه ابنُ حبان وابن السُّني وصححه \nالحافظُ ابن حجر  والشيخ ناصر الدين الألباني ",
    hokm: "",
  ),
  ahadit(
    hadit:
        " يقول الله سبحانه وتعالى: ' وَمَنْ يَتَّقِ اللَّهَ يَجْعَلْ لَهُ مَخْرَجًا  *  'وَيَرْزُقْهُ مِنْ حَيْثُ لَا يَحْتَسِبُ ",
    mosnad: " الآية : 2-3",
    hokm: " الطلاق ",
  ),
  ahadit(
    hadit:
        " عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ : ' إِنَّ عِظَمَ الْجَزَاءِ مَعَ عِظَمِ الْبَلَاءِ وَإِنَّ اللَّهَ إِذَا أَحَبَّ قَوْمًا ابْتَلَاهُمْ، فَمَنْ رَضِيَ فَلَهُ الرِّضَا، وَمَنْ سَخِطَ فَلَهُ السَّخَطُ ' ",
    mosnad:
        " (حديث : إذا أراد الله .... ) حسن صحيح\n (حديث : إن عظم الجزاء ....) حسن ",
    hokm: " ",
  ),
  ahadit(
    hadit:
        " قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : ' عَجَبًا لِأَمْرِ الْمُؤْمِنِ، إِنَّ أَمْرَهُ كُلَّهُ خَيْرٌ، وَلَيْسَ ذَاكَ لِأَحَدٍ إِلَّا لِلْمُؤْمِنِ ؛ إِنْ أَصَابَتْهُ سَرَّاءُ شَكَرَ فَكَانَ خَيْرًا لَهُ، وَإِنْ أَصَابَتْهُ ضَرَّاءُ صَبَرَ فَكَانَ خَيْرًا لَهُ' ",
    mosnad:
        " مرفوع | حديث رقم :2999 | مجلد رقم  : 8 \n صفحة رقم  : 227 | كتاب : الزهد والرقاق \n باب :  المؤمن أمره كله خير ",
    hokm: "",
  ),
  ahadit(
    hadit:
        " عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ :' مَا يُصِيبُ الْمُسْلِمَ مِنْ  نَصَبٍ  وَلَا وَصَبٍ، وَلَا هَمٍّ وَلَا حُزْنٍ، وَلَا أَذًى وَلَا غَمٍّ، حَتَّى الشَّوْكَةِ يُشَاكُهَا إِلَّا كَفَّرَ اللَّهُ بِهَا مِنْ خَطَايَاهُ ' ",
    mosnad:
        " مرفوع | حديث رقم  : 5641,5642 \n مجلد رقم : 7 | صفحة رقم : 114 \n كتاب المرضى \n باب ماجاء في كفارة المرض ",
    hokm: "",
  ),
  ahadit(
      hadit:
          "اللهم إني أسألك يا من لا تغلطه المسائل ويا من لا يشغله سمع عن سمع يا من لا يبرمه إلحاح الملحين.. اللهم أني أعوذ بك من جهد البلاء ودرك الشقاء وسوء القضاء وشماتة الأعداء دعاء الحزن والضيق يا لطيف.. يا لطيف.. يا لطيف الطف بي بلطفك الخفي و أعني بقدرتك",
      mosnad: "",
      hokm: ''),
  ahadit(
      hadit:
          "اللهم إني أنتظر فرجك وأرقب لطفك فالطف بي ولا تكلني إلى نفسي ولا إله غيرك لا إله إلا الله الرحمن الرحيم",
      mosnad: "",
      hokm: ""),
  ahadit(
      hadit:
          "اللهم إني أنزلت بك حاجتي كلها الظاهرة والباطنة والدنيوية والأخروية، اللهم اكفني ما همني وما لا أهتم له.. اللهم زودني بالتقوى واغفر لي ذنبي ووجهني للخير أينما توجهت اللهم يسرني لليسرى وجنبني للعسرى",
      mosnad: "",
      hokm: ""),
  ahadit(
      hadit:
          "اللهم اجعل لي من كل ما أهمني وكربني من أمر دنياي وآخرتي فرجًا ومخرجًا، وارزقني من حيث لا احتسب واغفر لي ذنوبي وثبت رجاك في قلبي واقطعه ممن سواك، حتى لا أرجو أحدًا غيرك يا من يكتفي من خلقه جميعًا ولا يكتفي منه أحد من خلقه، يا أحد من لا أحد له انقطع الرجاء إلا منك أغثني",
      mosnad: "",
      hokm: ""),
];

List<ahadit> domoae = [
  ahadit(
      hadit:
          " قال تعالى: ' وَإِذَا سَأَلَكَ عِبَادِي عَنِّي فَإِنِّي قَرِيبٌ ۖ أُجِيبُ دَعْوَةَ الدَّاعِ إِذَا دَعَانِ ۖ فَلْيَسْتَجِيبُوا لِي وَلْيُؤْمِنُوا بِي لَعَلَّهُمْ يَرْشُدُونَ' ",
      mosnad: " الآية : 182 ",
      hokm: "البقرة"),
  ahadit(
      hadit:
          " كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَدْعُو عِنْدَ الْكَرْبِ :' لَا إِلَهَ إِلَّا اللَّهُ الْعَظِيمُ الْحَلِيمُ، لَا إِلَهَ إِلَّا اللَّهُ رَبُّ السَّمَاوَاتِ وَالْأَرْضِ رَبُّ الْعَرْشِ الْعَظِيمِ ' ",
      mosnad:
          " مرفوع | حديث رقم : 6345 \n مجلد رقم  : 8 | صفحة رقم  : 75 \n كتاب : الدعوات باب الدعاء عند الكرب ",
      hokm: ""),
  ahadit(
      hadit:
          "' يَا فَارِجَ الْهَمِّ ، وَيَا كَاشِفَ الْغَمِّ ، فَرِّجْ هَمِّي وَيَسِّرْ أَمْرٍي ، وَارْحَمْ ضُعْفِي وَقِلَّةَ حِيْلَتِي ، وَارْزُقْنِي مِنْ حَيْثُ لَا أَحْتَسِبْ يَا رَبَّ الْعَالَمِينْ '",
      mosnad: "لم يتبت على رسول الله\n صلى الله عليه وسلم",
      hokm: ""),
  ahadit(
      hadit:
          " ' اللَّهُمَّ رَحْمَتَكَ أَرْجُو فَلاَ تَكَلْنِي إِلَى نَفْسِي طَرْفَةَ عَيْنٍ وَأَصْلِحْ لِي شَأْنِي كُلَّهُ لاَ إِلَهَ إِلاَّ أَنْتْ ' ",
      mosnad: "",
      hokm: ""),
  ahadit(
      hadit:
          " 'وقال الله تعالى: ' وَلَنَبْلُوَنَّكُمْ بِشَيْءٍ مِنَ الْخَوْفِ وَالْجُوعِ وَنَقْصٍ مِنَ الْأَمْوَالِ وَالْأَنْفُسِ وَالثَّمَرَاتِ وَبَشِّرِ الصَّابِرِينَ * الَّذِينَ إِذَا أَصَابَتْهُمْ مُصِيبَةٌ قَالُوا إِنَّا لِلَّهِ وَإِنَّا إِلَيْهِ رَاجِعُونَ * أُولَئِكَ عَلَيْهِمْ صَلَوَاتٌ مِنْ رَبِّهِمْ وَرَحْمَةٌ وَأُولَئِكَ هُمُ الْمُهْتَدُونَ '' ",
      mosnad: " الآية : 155-157",
      hokm: "البقرة"),
  ahadit(
      hadit:
          " 'عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ : ' مَا يُصِيبُ الْمُسْلِمَ مِنْ  نَصَبٍ  وَلَا وَصَبٍ، وَلَا هَمٍّ وَلَا حُزْنٍ، وَلَا أَذًى وَلَا غَمٍّ، حَتَّى الشَّوْكَةِ يُشَاكُهَا إِلَّا كَفَّرَ اللَّهُ بِهَا مِنْ خَطَايَاهُ '' ",
      mosnad:
          "مرفوع | حديث رقم : 5641,5642 \n مجلد رقم : 7 | صفحة رقم : 114 \n  كتاب المرضى - باب ماجاء في كفارة المرض",
      hokm: ""),
  ahadit(
      hadit:
          " ' الله تعالى: ' أَمَّنْ يُجِيبُ الْمُضْطَرَّ إِذَا دَعَاهُ وَيَكْشِفُ السُّوءَ وَيَجْعَلُكُمْ خُلَفَاءَ الْأَرْضِ أَإِلَهٌ مَعَ اللَّهِ قَلِيلًا مَا تَذَكَّرُون 'َ ' ",
      mosnad: "الآية : 62",
      hokm: " النمل "),
  ahadit(
      hadit:
          " كان صلى الله عليه وسلم يدعوا عند الكرب فيقول : ' لا إله إلا الله العظيم الحليم، لا إله إلا الله رب السموات والأرض، ورب العرش العظيم ' ",
      mosnad:
          " مرفوع | حديث رقم : 6345 \n مجلد رقم  : 8 | صفحة رقم : 75 \n كتاب : الدعوات \n باب الدعاء عند الكرب ",
      hokm: ""),
  ahadit(
      hadit:
          " سبحان الله، والحمد لله، ولا إله إلا الله، والله أكبر، ولا حول ولا قوة إلا بالله، سبحان الله وبحمده سبحان الله العظيم، لا إله إلا الله وحده لا شريك له، له الملك، وله الحمد، وهو على كل شيء قدير \n   قال تعالى : 'الَّذِينَ آمَنُوا وَتَطْمَئِنُّ قُلُوبُهُمْ بِذِكْرِ اللَّهِ أَلَا بِذِكْرِ اللَّهِ تَطْمَئِنُّ الْقُلُوبُ' ",
      mosnad: " الآية : 28 ",
      hokm: " الرعد"),
  ahadit(
      hadit:
          "قال تعالى 'أَنِّي مَسَّنِيَ الضُّرُّ وَأَنتَ أَرْحَمُ الرَّاحِمِينَ'",
      mosnad: " الاية : 83",
      hokm: "الأنبياء"),
  ahadit(
      hadit:
          "قال تعالى 'حَسْبِيَ اللّهُ لا إِلَهَ إِلاَّ هُوَ عَلَيْهِ تَوَكَّلْتُ وَهُوَ رَبُّ الْعَرْشِ الْعَظِيمِ'",
      mosnad: "آية:129",
      hokm: "التوبة"),
  ahadit(
      hadit:
          "قال رسول الله صلى الله عليه وسلم : 'اللَّهمَّ ربَّ السَّمواتِ السَّبعِ وربَّ العرشِ العظيمِ ربَّنا وربَّ كلِّ شيءٍ أنتَ الظَّاهرُ فليس فوقَكَ شيءٌ وأنتَ الباطنُ فليس دونَكَ شيءٌ مُنزِلَ التَّوراةِ والإنجيلِ والفُرقانِ فالقَ الحَبِّ والنَّوى أعوذُ بكَ مِن شرِّ كلِّ شيءٍ أنتَ آخِذٌ بناصيتِه أنتَ الأوَّلُ فليس قبْلَكَ شيءٌ وأنتَ الآخِرُ فليس بعدَكَ شيءٌ اقضِ عنَّا الدَّينَ وأَغْنِنا مِن الفقرِ'",
      mosnad:
          "رواه ابن حبان، في صحيح ابن حبان\nعن أبي هريرة، الصفحة أو الرقم:966،\n صحيح",
      hokm: ""),
];

List<ahadit> radab = [
  ahadit(
      hadit:
          "أعوذ بالله من الشيطان الرجيم. لا إله إلا الله العظيم الحليم، لا إله إلا الله رب العرش العظيم، لا إله إلا الله رب السموات ورب العرش الكريم",
      mosnad: "",
      hokm: ""),
  ahadit(
      hadit:
          "اللهم إني أسألك يا من لا يشغله سمع عن سمع يا من لا يبرمه إلحاح الملحين، اللهم أني أعوذ بك من جهد البلاء ودرك الشقاء وسوء القضاء وشماتة الأعداء",
      mosnad: "",
      hokm: ""),
  ahadit(
      hadit:
          "عن سليمان بن صرد قال : كنت جالساً مع النبي صلى الله عليه وسلم ، ورجلان يستبّان ، فأحدهما احمرّ وجهه واتفخت أوداجه ( عروق من العنق ) فقال النبي صلى الله عليه وسلم :’ إني لأعلم كلمة لو قالها ذهب عنه ما يجد ، لو قال أعوذ بالله من الشيطان ذهب عنه ما يجد’ ",
      mosnad:
          "مرفوع | حديث رقم : 3282 \n مجلد رقم : 4 | صفحة رقم : 124 \n كتاب : بدء الخلق \n باب صفة ابليس وجنوده",
      hokm: ""),
  ahadit(
      hadit:
          "ومما جاء في الدعاء عند الغضب قوله -تعالى-: ‘وَإِمَّا يَنزَغَنَّكَ مِنَ الشَّيْطَانِ نَزْغٌ فَاسْتَعِذْ بِاللَّـهِ إِنَّهُ هُوَ السَّمِيعُ الْعَلِيمُ’",
      mosnad: "الآية : 200",
      hokm: " الأعراف"),
  ahadit(
      hadit:
          " ورد عن النبي صلى الله عليه وسلم طلبه من الله الرضا عند الغضب، إذ قال عليه الصلاة والسلام:'اللهمَّ إِنَّي أسألُكَ خشْيَتَكَ في الغيبِ والشهادَةِ، وأسألك كَلِمَةَ الْحَقِّ فِي الرِّضَا والغضَبِ' ",
      mosnad:
          " رواه الألباني، في الكلم الطيب \n عمار بن ياسر، الصفحة أو الرقم:106\nصحيح ",
      hokm: ""),
  ahadit(
      hadit:
          " قال تعالى :' اسْتَغْفِرُوا رَبَّكُمْ إِنَّهُ كَانَ غَفَّارًا، يُرْسِلِ السَّمَاءَ عَلَيْكُم مِّدْرَارًا، وَيُمْدِدْكُم بِأَمْوَالٍ وَبَنِينَ وَيَجْعَل لَّكُمْ جَنَّاتٍ وَيَجْعَل لَّكُمْ أَنْهَارًا' ",
      mosnad: "الآية : 10",
      hokm: "نوح"),
  ahadit(
      hadit:
          " الله تعالى: 'إِنَّمَا يُوَفَّى الصَّابِرُونَ أَجْرَهُم بِغَيْرِ حِسَابٍ ' ",
      mosnad: "الآية :10",
      hokm: " الزمر"),
  ahadit(
      hadit:
          " وقال الله جل وعلا: ادْفَعْ بِالَّتِي هِيَ أَحْسَنُ فَإِذَا الَّذِي بَيْنَكَ وَبَيْنَهُ عَدَاوَةٌ كَأَنَّهُ وَلِيٌّ حَمِيمٌ * وَمَا يُلَقَّاهَا إِلَّا الَّذِينَ صَبَرُوا وَمَا يُلَقَّاهَا إِلَّا ذُو حَظٍّ عَظِيمٍ  ",
      mosnad: "الآية : 35 - 34",
      hokm: "فصلت"),
  ahadit(
      hadit:
          "وقال صلى الله عليه وسلم : إذا غضب الرجل فقال أعوذ بالله ، سكن غضبه",
      mosnad: "صحيح جامع",
      hokm: ""),
  ahadit(
      hadit: ". قال رسول الله صلى الله عليه وسلم : ' إذا غضب أحدكم فليسكت ' ",
      mosnad: "رواه الامام أحمد المسند \nوفي صحيح جامع",
      hokm: ""),
  ahadit(
      hadit:
          "قال رسول الله صلى الله عليه وسلم : ‘ إذا غضب أحدكم وهو قائم فليجلس ، فإن ذهب عنه الغضب وإلا فليضطجع’",
      mosnad:
          "مرفوع | حديث رقم : 4782,4783 \n مجلد رقم : 5 | صفحة رقم : 92 \n أول كتاب الأدب \n باب : مايقال عند الغضب",
      hokm: ""),
  ahadit(
      hadit:
          " عن أبي هريرة رضي الله عنه أن رجلاً قال للنبي صلى الله عليه وسلم : ' أوصِني. قال : لا تغضب . فردّد ذلك مراراً ، قال : لا تغضب ' ",
      mosnad:
          "مرفوع | حديث رقم : 6116 \n مجلد رقم : 8 | صفحة رقم : 28 \n كتاب الادب \n باب الحدر من الغضب",
      hokm: ""),
  ahadit(
      hadit:
          "قَالَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ  : ' مَنْ كَظَمَ غَيْظًا وَهُوَ قَادِرٌ عَلَى أَنْ يُنْفِذَهُ ؛ دَعَاهُ اللَّهُ عَزَّ وَجَلَّ عَلَى رُءُوسِ الْخَلَائِقِ يَوْمَ الْقِيَامَةِ حَتَّى يُخَيِّرَهُ اللَّهُ مِنَ الْحُورِ الْعِينِ مَا يَشَاءُ '",
      mosnad:
          "مرفوع | حديث رقم :2021 \n مجلد رقم : 3 | صفحة رقم :547 \n أبواب البر والصلة \nعن رسول الله صلى الله عليه وسلم \n باب : في كظم الغيظ",
      hokm: ""),
];

List<ahadit> khawf = [
  ahadit(
      hadit:
          " 'اللهم يا مالك الملك ويا ذا الجلال والإكرام، إني أسألك باسمك الأعظم الذي إذا سئلت بها أعطيت، وإذا دُعيت به استجبت، أن تفرج عني كربتي، وترفع عني الهم والغم وضيق الصدر، وتعيذني من السوء وشتات الأمر، وأن تنزل علي رحماتك وسلامك، وأمنك وأمانك، وتملأ قلبي بالنور والسكينة، وتملأ نفسي الفرح والبهجة، اللهم كن لي جارًا من شر خلقك كلهم، واكفني شر الحاسدين والمعتدين، وانصرني بنصرك وتأييدك يا معين يا رحيم' ",
      mosnad: "",
      hokm: ""),
  ahadit(
      hadit:
          " 'اللهمّ ربّ السموات السبع وما أظلّت، وربّ الأرضين وما أقلّت، وربّ الشياطين وما أضلّت، كن لي جارًا من شرّ خلقك كلّهم جميعًا أن يفرط عليّ أحد، وأن يبغي عليّ عزّ جارك، وجلّ ثناؤك، ولا إله غيرك، ولا إله إلّا أنت' ",
      mosnad: "",
      hokm: ""),
  ahadit(
      hadit:
          "اللهمّ إنّي أسألك باسمك العظيم الأعظم الّذي إذا دعيت به أجبت وإذا سُئلت به أعطيت، وإذا استرحمت به رحمت، وإذا استفرجت به فرجت أن تفرّج عنّي ما أنا فيه وأن تكفني شرّ الحاسدين والمعادين، وانصرني عليهم بنصرك وتأييدك يا قويّ يا معين",
      mosnad: "",
      hokm: ""),
  ahadit(
      hadit:
          " 'اللهم آمن خوفي واقل عثرتي وأذهب حزني وحرصي وكن لي وخذني إليك مني وارزقني الفناء عني ولا تجعلني مفتونا بنفسي محجوبا بحسي واجعل القران ربيع قلبي ونور بصري وجلاء حزني وذهاب همي ولا تسلط علي من لا يخافك ولا يرحمني يا الله وصل اللهم وسلم علي خير الانام' ",
      mosnad: "",
      hokm: ""),
  ahadit(
      hadit:
          " 'ربي لا أحد يسمع صوت قلبي غيرك و أنا أثق بك و أتوكل عليك بأنك ستزيل حزني و همي و خوفي و تبدله بسعاده و فرح اللهم إني أسألك أن تبشرني بشاره خير تجعلني أنسى كل ما مضى من تعب بشاره تفرح قلبي و تريح بالي و تجعلني أسجد لك باكيه شاكره لتدبيرك… اللهُم ضياءًا منك يُنير دربي وأمانًا يُزيحُ خوفي، وعونًا احتمي به من فجائع الدُنيا، وكُن لقلبي حاميًا وشافيًا وكافيًا يا الله' ",
      mosnad: "",
      hokm: ""),
  ahadit(
      hadit:
          " 'اللهم أبدل قلقي سكينة وهمي انشراح وسخطي رضا وخوفي طمأنينة وعجزي قدرة وحزني فرح و ضيقي سعة وعسري يُسر وضعفي قوة' ",
      mosnad: "",
      hokm: ""),
  ahadit(
      hadit:
          " 'اللهم لجأتُ إليك بحزني، همي ضيقتي و خوفي اللهم فاستبدل كل حزني بسعادة تنسيني بؤسي وقلة حيلتي' ",
      mosnad: "",
      hokm: ""),
  ahadit(
      hadit:
          " 'اللهم آمن آمن خوفي واشرح صدري وفرج واشر همي وبدل حزني فرحا. اللهم اني اناجيك من همي و حزني و خوفي و قلقي و المي و كربي و جرحي و كسرتي فاغيثني' ",
      mosnad: "",
      hokm: ""),
  ahadit(
      hadit:
          " 'أعوذ بكلمات الله التامّات من غضبه وعقابه، وشرّ عباده، ومن همزات الشّياطين” اللهم بدل خوفي بأمان و حُزني بفرح و همي بفرج' ",
      mosnad: "",
      hokm: ""),
  ahadit(
      hadit:
          " 'بسم الله الذي لا يضر مع اسمه شيء في الأرض ولا في السماء وهو السميع العليم' ",
      mosnad: "",
      hokm: ""),
  ahadit(
      hadit: " 'أعوذ بكلمات الله التامات من شر ما خلق' ", mosnad: "", hokm: ""),
  ahadit(
      hadit:
          " 'اللَّهمَّ ربَّ السَّمواتِ السَّبعِ، وربَّ العرشِ العظيمِ، ربَّنا وربَّ كلِّ شيءٍ، أنتَ الظَّاهرُ فليس فوقَكَ شيءٌ، وأنتَ الباطنُ فليس دونَكَ شيءٌ، مُنزِلَ التَّوراةِ، والإنجيلِ، والفُرقانِ، فالقَ الحَبِّ والنَّوى، أعوذُ بكَ مِن شرِّ كلِّ شيءٍ أنتَ آخِذٌ بناصيتِه، أنتَ الأوَّلُ فليس قبْلَكَ شيءٌ، وأنتَ الآخِرُ فليس بعدَكَ شيءٌ' ",
      mosnad: "",
      hokm: ""),
  ahadit(
      hadit:
          " 'اللهمَّ إنِّي أسْألُكَ بأنَّ لكَ الحَمدَ لا إلَهَ إلَّا أنتَ، المنَّانُ، بَديعُ السَّمواتِ والأرْضِ، ذا الجَلالِ والإكْرامِ، يا حَيُّ يا قَيُّومُ، إنِّي أسألُكَ أن تزيل قلقي وخوفي من حدوث هذا الأمر' ",
      mosnad: "",
      hokm: ""),
  ahadit(
      hadit:
          " 'اللَّهُمَّ إنِّي أعُوذُ بكَ مِنَ الهَمِّ والحَزَنِ، والعَجْزِ والكَسَلِ، والبُخْلِ والجُبْنِ، وضَلَعِ الدَّيْنِ، وغَلَبَةِ الرِّجَالِ' ",
      mosnad: "",
      hokm: ""),
  ahadit(
      hadit:
          " 'يا عزيز يا حميد، يا ذا العرش المجيد، اصرف عني شر كل جبار عنيد، اللهم إنك تعلم أنني على إساءتي وظلمي وإسرافي لم أجعل لك ولدًا ولا ندًا، ولا صاحبة ولا كفوًا أحد، فإن تُعذب فأنا عبدك، وإن تغفر فإنك العزيز الحكيم' ",
      mosnad: "",
      hokm: ""),
  ahadit(
      hadit:
          " ' حسبي الله لما أهمّني، حسبي الله لمن بغى علي، حسبي الله لمن حسدني، حسبي الله لمن كادني بسوء، حسبي الله عند الموت، حسبي الله عند الصراط، حسبي الله لا إله إلا هو عليه توكلت وهو رب العرش العظيم' ",
      mosnad: "",
      hokm: ""),
  ahadit(
      hadit:
          "اللَّهمَّ إنِّي أسألُكَ منَ الخيرِ كلِّهِ عاجلِهِ وآجلِهِ ما علمتُ منهُ وما لم أعلمْ وأعوذُ بكَ منَ الشَّرِّ كلِّهِ عاجلِهِ وآجلِهِ ما علمتُ منهُ وما لم أعلمْ اللَّهمَّ إنِّي أسألُكَ من خيرِ ما سألكَ عبدُكَ ونبيُّكَ وأعوذُ بكَ من شرِّ ما عاذَ منه عبدُكَ ونبيُّكَ اللَّهمَّ إنِّي أسألُكَ الجنَّةَ وما قرَّبَ إليها من قولٍ وعملٍ وأعوذُ بكَ منَ النَّارِ وما قرَّبَ إليها من قولٍ أو عملٍ وأسألُكَ أن تجعلَ كلَّ قضاءٍ قضيتَهُ لي خيرًا",
      mosnad: "",
      hokm: ""),
  ahadit(
      hadit:
          " 'اللهمَّ بعلْمِك الغيبِ، وقدْرتِك على الخلقِ أحْيِني ما علمتَ الحياةَ خيرًا لي، وتوفَّني إذا علِمْتَ الوفاةَ خيرًا لي، اللهمَّ وأسألُك خشيتَك في الغيبِ والشهادةِ، وأسألُك كلمةَ الإخلاصِ في الرضا والغضبِ، وأسألُك القصدَ في الفقرِ والغنى، وأسألُك نعيمًا لا ينفدُ وأسألُك قرةَ عينٍ لا تنقطعُ، وأسألُك الرضا بالقضاءِ، وأسألُك بَرْدَ العيْشِ بعدَ الموتِ، وأسألُك لذَّةَ النظرِ إلى وجهِك، والشوقَ إلى لقائِك، في غيرِ ضرَّاءَ مضرةٍ، ولا فتنةٍ مضلَّةٍ اللهمَّ زيِّنا بزينةِ الإيمانِ، واجعلْنا هداةً مُهتدينَ' ",
      mosnad: "",
      hokm: ""),
  ahadit(
      hadit:
          "قوله تعالي:'هُوَ الَّذِي أَنزَلَ السَّكِينَةَ فِي قُلُوبِ الْمُؤْمِنِينَ لِيَزْدَادُوا إِيمَانًا مَّعَ إِيمَانِهِمْ وَلِلَّهِ جُنُودُ السَّمَاوَاتِ وَالأَرْضِ وَكَانَ اللَّهُ عَلِيمًا حَكِيمًا، وكذلك: إِذْ يُغَشِّيكُمُ النُّعَاسَ أَمَنَةً مِنْهُ وَيُنَزِّلُ عَلَيْكُمْ مِنَ السَّمَاءِ مَاءً لِيُطَهِّرَكُمْ بِهِ وَيُذْهِبَ عَنْكُمْ رِجْزَالشَّيْطَانِ وَلِيَرْبِطَ عَلَىٰ قُلُوبِكُمْ وَيُثَبِّتَ بِهِ الأَقْدَامَ'",
      mosnad: " الآية : 3 ",
      hokm: " الفتح "),
  ahadit(
      hadit:
          "قوله تعالي:'  قُلْ هُوَ اللَّـهُ أَحَدٌ.. اللَّـهُ الصَّمَدُ.. لَمْ يَلِدْ وَلَمْ يُولَدْ.. ولم يكن لَّهُ كُفُوًا أَحَدٌ' \nوقوله تعالى : 'قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ.. مِن شَرِّ مَا خَلَقَ.. وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ.. وَمِن شَرِّ النَّفَّاثَاتِ فِي الْعُقَدِ.. وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ' \nوقوله تعالى : 'قُلْ أَعُوذُ بِرَبِّ النَّاسِ. مَلِكِ النَّاسِ.. إله الناس.. مِن شَرِّ الْوَسْوَاسِ الْخَنَّاسِ.. الَّذِي يُوَسْوِسُ فِي صُدُورِ النَّاسِ.. مِنَ الْجِنَّةِ وَالنَّاسِ'",
      mosnad: "الإخلاص \nالفلق\n الناس \n ",
      hokm: ""),
];

List<ahadit> tika = [
  ahadit(
    hadit:
        " عن عائشة قال رسول الله صلى الله عليه وسلم: ' لا يقولن أحدكم: خبثت نفسي، ولكن ليقل: لقست نفسي' ومعنى لقست أي: غثت أو ضاقت؛ وفي هذا الحديث نهي عن تحقير الإنسان لنفسه ",
    mosnad:
        " مرفوع | حديث رقم : 6179 \n مجلد رقم : 8 | صفحة رقم : 41 \n كتاب : الادب \n باب : لايقل : خبثت نفسي ",
    hokm: "",
  ),
  ahadit(
    hadit:
        " قوله صلى الله عليه وسلم في حق النفس على صاحبها: 'لِنَفْسِكَ عَلَيْكَ حَقًّا.. فأعْطِ كُلَّ ذِي حَقٍّ حَقَّهُ' ",
    mosnad:
        "مرفوع | حديث رقم : 2413 \n مجلد رقم : 4 | صفحة رقم : 212 \n ابواب الزهد الزهد عن رسول الله\n صلى الله عليه وسلم",
    hokm: "",
  ),
  ahadit(
    hadit:
        " قال تعالى ' وَإِذْ قَالَ رَبُّكَ لِلْمَلَائِكَةِ إِنِّي جَاعِلٌ فِي الْأَرْضِ خَلِيفَةً ۖ قَالُوا أَتَجْعَلُ فِيهَا مَن يُفْسِدُ فِيهَا وَيَسْفِكُ الدِّمَاءَ وَنَحْنُ نُسَبِّحُ بِحَمْدِكَ وَنُقَدِّسُ لَكَ ۖ قَالَ إِنِّي أَعْلَمُ مَا لَا تَعْلَمُونَ ' ",
    mosnad:
        " ربك العليم، الحكيم، خلقك لمعنى رأه فيك لا في غيرك\n أنت ممن علم فيهم ما لا يعلمه أحد من مخلوقاته، ما لم تراه أنت في نفسك\n تذكر هذا",
    hokm: " الآية 30 \n البقرة",
  ),
  ahadit(
    hadit:
        " قال تعالى : 'إِنَّا لَنَنْصُرُ رُسُلَنَا وَالَّذِينَ آمَنُوا فِي الْحَيَاةِ الدُّنْيَا وَيَوْمَ يَقُومُ الْأَشْهَادُ' ",
    mosnad: " الاية :57 ",
    hokm: " غافر ",
  ),
  ahadit(
    hadit:
        " قال تعالى:   'الَّذِينَ آمَنُوا وَتَطْمَئِنُّ قُلُوبُهُم بِذِكْرِ اللَّهِ أَلَا بِذِكْرِ اللَّهِ تَطْمَئِنُّ الْقُلُوبُ' ",
    mosnad: "الاية : 28",
    hokm: "الرعد",
  ),
  ahadit(
    hadit:
        " قال تعالى :  مَنْ كَانَ يَظُنُّ أَنْ لَنْ يَنْصُرَهُ اللَّهُ فِي الدُّنْيَا وَالْآخِرَةِ فَلْيَمْدُدْ بِسَبَبٍ إِلَى السَّمَاءِ ثُمَّ لْيَقْطَعْ فَلْيَنْظُرْ هَلْ يُذْهِبَنَّ كَيْدُهُ مَا يَغِيظُ' ",
    mosnad: " الاية : 15 ",
    hokm: "الحج",
  ),
  ahadit(
    hadit:
        "قال تعالى :  ' يَا أَيُّهَا النَّاسُ إِنَّ وَعْدَ اللَّهِ حَقٌّ فَلَا تَغُرَّنَّكُمُ الْحَيَاةُ الدُّنْيَا وَلَا يَغُرَّنَّكُمْ بِاللَّهِ الْغَرُورُ'",
    mosnad: "الاية : 5",
    hokm: " فاطر ",
  ),
  ahadit(
    hadit:
        "قال تعالى :  'وَلَقَدْ سَبَقَتْ كَلِمَتُنَا لِعِبَادِنَا الْمُرْسَلِينَ * إِنَّهُمْ لَهُمُ الْمَنْصُورُونَ * وَإِنَّ جُنْدَنَا لَهُمُ الْغَالِبُون'",
    mosnad: "الاية : 171-173",
    hokm: "الصافات",
  ),
  ahadit(
    hadit:
        "قال تعالى : 'فَاصْبِرْ إِنَّ وَعْدَ اللَّهِ حَقٌّ وَاسْتَغْفِرْ لِذَنْبِكَ وَسَبِّحْ بِحَمْدِ رَبِّكَ بِالْعَشِيِّ وَالْإِبْكَار'",
    mosnad: "الاية : 55",
    hokm: " غافر",
  ),
];

List<ahadit> kaaba = [
  ahadit(
    hadit:
        "أكثر تلاوة القرآن\n لقوله جل لجلاله : ' يا أَيُّهَا النَّاسُ قَدْ جَآءَتْكُمْ مَّوْعِظَةٌ مِّن رَّبِّكُمْ وَشِفَآءٌ لِّمَا فِي الصُّدُورِ وَهُدًى وَرَحْمَةٌ لِّلْمُؤْمِنِينَ '",
    mosnad: "الاية : 57",
    hokm: "يونس",
  ),
  ahadit(
    hadit:
        "قال صلى الله عليه وسلم 'قُلْ إذا أصبحتَ وإذا أمسيْتَ اللَّهمَّ إنِّي أعوذُ بك من الهمِّ والحزنِ وأعوذُ بك من العجزِ والكسلِ وأعوذُ بك من البخلِ والجبنِ وأعوذُ بك من غلبةِ الدَّينِ وقهرِ الرِّجالِ'",
    mosnad:
        " مرفوع |حديث رقم : 1555 \n مجلد رقم : 2 | صفحة رقم : 132 \n كتاب الصلاة - باب في الاستعادة ",
    hokm: "",
  ),
  ahadit(
    hadit:
        " قال تعالى : 'إِنَّهُ لَا يَيْأَسُ مِن رَّوْحِ اللَّهِ إِلَّا الْقَوْمُ الْكَافِرُونَ' ",
    mosnad: "الاية : 87",
    hokm: "يوسف",
  ),
  ahadit(
    hadit:
        " قال تعالى : 'يَا أَيُّهَا الَّذِينَ آمَنُوا اسْتَعِينُوا بِالصَّبْرِ وَالصَّلاةِ إِنَّ اللَّهَ مَعَ الصَّابِرِينَ' ",
    mosnad: " الاية : 153 ",
    hokm: " البقرة ",
  ),
  ahadit(
    hadit:
        " عن حذيفةَ قالَ كانَ النَّبيُّ صلَّى اللَّهُ عليْهِ وسلَّمَ إذا حزبَهُ أمرٌ صلَّى ",
    mosnad: " سنن أبي داود ",
    hokm: "",
  ),
  ahadit(
    hadit: " قال صلى الله عليه وسلم : 'يا بلالُ أقمِ الصلاةَ، أرِحْنا بها' ",
    mosnad:
        "مرفوع | رقم الحديث : 4985 \n مجلد رقم :5 | صفحة رقم : 165 \n أول كتاب الادب - باب : في صلاة العتمة",
    hokm: "",
  ),
  ahadit(
    hadit:
        " رسول الله صلى الله عليه وسلم قال: 'دعوات المكروب: اللهم رحمتك أرجو فلا تكلني إلى نفسي طرفة عين، وأصلح لي شأني كله لا إله إلا أنت' ",
    mosnad:
        " مرفوع | حديث رقم :5090 \n مجلد رقم : 5 | صفحة رقم : 204 \n أ,ل كتاب الادب - أبواب النوم \n باب : ما يقةل اذا أصبح ",
    hokm: "",
  ),
];
List<ahadit> chak = [
  ahadit(
    hadit:
        " قال تعالى :' اللَّهُ لَا إِلَهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ لَهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ مَنْ ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلَّا بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلَا يُحِيطُونَ بِشَيْءٍ مِنْ عِلْمِهِ إِلَّا بِمَا شَاءَ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ' ",
    mosnad: " الاية : 255 ",
    hokm: " البقرة ",
  ),
  ahadit(
    hadit:
        " ردد قوله تعالى : 'وَقُل رَّبِّ أَعُوذُ بِكَ مِنْ هَمَزَاتِ الشَّيَاطِينِ . وَأَعُوذُ بِكَ رَبِّ أَن يَحْضُرُونِ' ",
    mosnad: "الاية : 97",
    hokm: "المؤمنون",
  ),
  ahadit(
    hadit:
        " ردد قوله تعالى : 'وَيُرِيدُ اللّهُ أَن يُحِقَّ الحَقَّ بِكَلِمَاتِهِ وَيَقْطَعَ دَابِرَ الْكَافِرِينَ . لِيُحِقَّ الْحَقَّ وَيُبْطِلَ الْبَاطِلَ وَلَوْ كَرِهَ الْمُجْرِمُونَ' ",
    mosnad: "الاية :7-8",
    hokm: "الانفال",
  ),
  ahadit(
    hadit:
        " ردد قوله تعلى : 'وَيُحِقُّ اللّهُ الْحَقَّ بِكَلِمَاتِهِ وَلَوْ كَرِهَ الْمُجْرِمُونَ'  ",
    mosnad: "الاية : 82",
    hokm: "يونس",
  ),
  ahadit(
    hadit:
        " قال تعالى : ' إِنَّ اللَّهَ يُدَافِعُ عَنِ الَّذِينَ آمَنُوا إِنَّ اللَّهَ لَا يُحِبُّ كُلَّ خَوَّانٍ كَفُورٍ ' ",
    mosnad: "الاية : 38",
    hokm: "الحج",
  ),
  ahadit(
    hadit:
        " قال تعالى : ''وَيَمْحُ اللَّهُ الْبَاطِلَ وَيُحِقُّ الْحَقَّ بِكَلِمَاتِهِ إِنَّهُ عَلِيمٌ بِذَاتِ الصُّدُورِ ",
    mosnad: "الاية : 24",
    hokm: "الشورى",
  ),
  ahadit(
    hadit:
        " قال تعالى : 'قُلْ أَعُوذُ بِرَبّ النّاسِ * مَلِكِ النّاسِ * إِلَهِ النّاسِ * مِن شَرّ الْوَسْوَاسِ الْخَنّاسِ * الّذِى يُوَسْوِسُ فِي صُدُورِ النّاسِ* مِنَ الْجِنّةِ وَالنّاسِ' ",
    mosnad: "سورة الناس",
    hokm: "",
  ),
  ahadit(
    hadit:
        " قال تعالى :'وَنُنَزِّلُ مِنَ الْقُرْآنِ مَا هُوَ شِفَاءٌ وَرَحْمَةٌ لِّلْمُؤْمِنِينَ ۙ وَلَا يَزِيدُ الظَّالِمِينَ إِلَّا خَسَارًا' ",
    mosnad: "الاية : 82",
    hokm: "الاسراء",
  ),
  ahadit(
    hadit:
        " ربّنا أفرغ علينا صبراً وتوفّنا مسلمين وألحقنا بالصّالحين وأفوّض أمري إلى الله، إنّ الله بصير بالعباد وحسبنا الله ونعم الوكيل. ولا حول ولا قوّة إلّا بالله العليّ العظيم، وصلّى الله على سيّدنا محمّد الحبيب وعلى آله وصحبه وسلّم. ",
    mosnad: "",
    hokm: "",
  ),
  ahadit(
    hadit:
        " قال تعالى : 'يَا أَيُّهَا الَّذِينَ آمَنُوا اجْتَنِبُوا كَثِيرًا مِّنَ الظَّنِّ إِنَّ بَعْضَ الظَّنِّ إِثْمٌ ۖ وَلَا تَجَسَّسُوا وَلَا يَغْتَب بَّعْضُكُم بَعْضًا ۚ أَيُحِبُّ أَحَدُكُمْ أَن يَأْكُلَ لَحْمَ أَخِيهِ مَيْتًا فَكَرِهْتُمُوهُ ۚ وَاتَّقُوا اللَّهَ ۚ إِنَّ اللَّهَ تَوَّابٌ رَّحِيمٌ' ",
    mosnad: "الاية : 12",
    hokm: "الحجرات",
  ),
  ahadit(
    hadit:
        " قال تعالى :'يَا أَيُّهَا الَّذِينَ آمَنُوا إِذَا ضَرَبْتُمْ فِي سَبِيلِ اللَّهِ فَتَبَيَّنُوا وَلَا تَقُولُوا لِمَنْ أَلْقَى إِلَيْكُمُ السَّلَامَ لَسْتَ مُؤْمِنًا تَبْتَغُونَ عَرَضَ الْحَيَاةِ الدُّنْيَا فَعِنْدَ اللَّهِ مَغَانِمُ كَثِيرَةٌ كَذَلِكَ كُنْتُمْ مِنْ قَبْلُ فَمَنَّ اللَّهُ عَلَيْكُمْ فَتَبَيَّنُوا إِنَّ اللَّهَ كَانَ بِمَا تَعْمَلُونَ خَبِيرًا' ",
    mosnad: "الاية : 24",
    hokm: "النساء",
  ),
  ahadit(
    hadit:
        " قال رسول الله صلى الله عليه وسم : 'لا يموتن أحدكم إلا وهو يحسن الظن بالله ' ",
    mosnad:
        "مرفوع | حديث رقم : 2877 \n مجلد رقم : 8 | صفحة رقم : 165 \n كناب الجنة وصفة نعيمها وأهلها \n باب: الامر بحسن الزن بالله يعلى عند الموت",
    hokm: "",
  ),
];
List<ahadit> tamae = [
  ahadit(
    hadit:
        " قال تعالى :'رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ' ",
    mosnad: " الاية : 201 ",
    hokm: "البقرة",
  ),
  ahadit(
    hadit:
        " قال تعالى :'مَنْ عَمِلَ صَالِحًا مِّن ذَكَرٍ أَوْ أُنثَى وَهُوَ مُؤْمِنٌ فَلَنُحْيِيَنَّهُ حَيَاةً طَيِّبَةً وَلَنَجْزِيَنَّهُمْ أَجْرَهُم بِأَحْسَنِ مَا كَانُواْ يَعْمَلُونَ' ",
    mosnad: "الاية : 97",
    hokm: "النحل",
  ),
  ahadit(
    hadit:
        " قال تعالى : 'إِن يَكُونُوا فُقَرَاء يُغْنِهِمُ اللَّهُ مِن فَضْلِهِ وَاللَّهُ وَاسِعٌ عَلِيم' ",
    mosnad: " الاية : 23 ",
    hokm: " النور ",
  ),
  ahadit(
    hadit:
        " قال رسول الله صلى الله عليه وسلم :'اللَّهُمَّ ارْزُقْ آلَ مُحَمَّدٍ قُوتًا' ",
    mosnad:
        " مرفوع | حديث رقم : 6460 \n مجلد رقم : 8 | صفحة رقم : 98 \n كتاب : الرفاق \n باب : كيق كان يعيش النبي صلى الله عليه وسلم وأصحابه ",
    hokm: "",
  ),
  ahadit(
    hadit:
        " قال رسول الله صلى الله عليه وسلم : 'مَن أصبحَ مِنكُم آمِنًا في سِرْبِه، مُعافًى في جسَدِهِ، عندَهُ قُوتُ يَومِه ، فَكأنَّمَا حِيزَتْ له الدُّنْيا' ",
    mosnad:
        "مرفوع | حديث رقم : 4141 \n مجلد رقم : 5 | صفحة رقم : 577 \n كتاب الزهد - باب :القناعة",
    hokm: "",
  ),
  ahadit(
    hadit:
        " قال رسول الله  صلى الله عليه وسلم : 'أَيُّهَا النَّاسُ اتَّقُوا اللهَ وَأَجْمِلُوا فِي الطَّلَبِ، فَإِنَّ نَفْسًا لَنْ تَمُوتَ حَتَّى تَسْتَوْفِيَ رِزْقَهَا وَإِنْ أَبْطَأَ عَنْهَا، فَاتَّقُوا اللهَ وَأَجْمِلُوا فِي الطَّلَبِ، خُذُوا مَا حَلَّ، وَدَعُوا مَا حَرُم' ",
    mosnad:
        "مرفوع | حديث رقم : 2144 \n مجلد رقم : 3 |صفحة رقم : 513 \n كتاب التجارات - باب : الاقتصاد في طلب المعيشة",
    hokm: "",
  ),
  ahadit(
    hadit:
        " قال تعالى : 'قَالَ اللّهُ هَذَا يَوْمُ يَنفَعُ الصَّادِقِينَ صِدْقُهُمْ لَهُمْ جَنَّاتٌ تَجْرِي مِن تَحْتِهَا الأَنْهَارُ خَالِدِينَ فِيهَا أَبَداً رَّضِيَ اللّهُ عَنْهُمْ وَرَضُواْ عَنْهُ ذَلِكَ الْفَوْزُ الْعَظِيم' ",
    mosnad: " الاية : 119",
    hokm: "المائدة",
  ),
  ahadit(
    hadit:
        "قال تعالى : 'وَلَوْ أَنَّهُمْ رَضُوْاْ مَا آتَاهُمُ اللّهُ وَرَسُولُهُ وَقَالُواْ حَسْبُنَا اللّهُ سَيُؤْتِينَا اللّهُ مِن فَضْلِهِ وَرَسُولُهُ إِنَّا إِلَى اللّهِ رَاغِبُون'",
    mosnad: "الاية : 59",
    hokm: "التوبة",
  ),
  ahadit(
    hadit:
        " قال تعالى: ' أَفَمَنْ أَسَّسَ بُنْيَانَهُ عَلَى تَقْوَى مِنَ اللّهِ وَرِضْوَانٍ خَيْرٌ أَم مَّنْ أَسَّسَ بُنْيَانَهُ عَلَىَ شَفَا جُرُفٍ هَارٍ فَانْهَارَ بِهِ فِي نَارِ جَهَنَّمَ وَاللّهُ لاَ يَهْدِي الْقَوْمَ الظَّالِمِين' ",
    mosnad: "الاية : 109",
    hokm: "التوبة",
  ),
  ahadit(
    hadit:
        " عن أبي هريرة رضي الله عنه قال: ' مَنْ يأخُذُ عَنِّي هؤُلاءِ الكلِماتِ فيعملُ بِهِنَّ -أَوْ يُعَلِّمُ مَنْ يعمَلُ بِهِنَّ-؟ فقالَ أبو هريرةَ: قلتُ: أنا يا رسولُ اللهِ فأخَذَ بيدِي فعدَّ خمْسًا وقال: اتقِ المحارِمَ تكنْ أعْبَدَ الناسِ، وارضَ بما قَسَمَ اللهُ لكَ تكُنْ أغْنَى الناسِ، وأحسِنْ إلى جارِكَ تكُنْ مؤمنًا، وأحِبَّ للناسِ ما تُحِبُّ لنفسِكَ، تَكُنْ مسلِمًا، وَلَا تُكْثِرِ الضَّحِكَ، فإِنَّ كثْرَةَ الضَّحِكِ تُمِيتُ القَلْب ' ",
    mosnad:
        "مرفوع | حديث رقم : 2305 \n مجلد رقم : 4 | صفحة رقم :140 \n أبواب الزهد عن رسول الله صلى الله عليه وسلم \n باب - من اتقى المحارم فهو أعبد الناس ",
    hokm: "",
  ),
  ahadit(
    hadit:
        "  عن النَّبيِّ صلى الله عليه وسلم قَالَ:' لَيس الغِنَى عَن كثْرَةِ العَرَضِ، وَلكِنَّ الغِنَى غِنَى النَّفْسِ' ",
    mosnad:
        "مرفوع | حديث رقم : 6446 \n مجلد رقم : 8 | صفحة رقم : 95 \n كتاب : الرفاق - باب : الغنى عن النفس",
    hokm: "",
  ),
];

List<ahadit> danb = [
  ahadit(
    hadit:
        " قال تعالى : 'للذين اتقوا  عند ربهم جنات تجري من تحتها الأنهار خالدين فيها وأزواج مطهرة ورضوان من الله ، والله بصير بالعباد ، الذين يقولون ربنا آمنا فاغفر لنا ذنوبنا وقنا عذاب النار ، الصابرين والصادقين والقانتين والمنفقين والمستغفرين بالاسحار' ",
    mosnad: " الاية : 15 ",
    hokm: " آل عمران",
  ),
  ahadit(
    hadit: " قال تعالى : 'واستغفروا الله إن الله كان غفورا رحيما' ",
    mosnad: " الاية : 106 ",
    hokm: " النساء",
  ),
  ahadit(
    hadit:
        " قال تعالى : 'وما كان الله ليعذبهم وأنت فيهم وما كان الله معذبهم وهم يستغفرون' ",
    mosnad: "الاية : 33",
    hokm: " الانفال ",
  ),
  ahadit(
    hadit:
        " قال تعالى : 'والذين إذا فعلوا فاحشة أو ظلموا أنفسهم ذكروا الله فاستغفروا لذنوبهم ، ومن يغفر الذنوب إلا الله ؟ ولم يصروا على ما فعلوا وهم يعلمون' ",
    mosnad: " الاية : 135 ",
    hokm: " آل عمران ",
  ),
  ahadit(
    hadit:
        " قال تعالى : 'ومن يعمل سوءا أو يظلم نفسه ثم يستغفر الله يجد الله غفورا رحيما' ",
    mosnad: "الاية : 110",
    hokm: "النساء",
  ),
  ahadit(
    hadit:
        " قال تعالى إخبارا عن نوح (صلى الله عليه وسلم) : 'فقلت استغفروا ربكم إنه كان غفارا' ",
    mosnad: " الاية :10 ",
    hokm: "نوح",
  ),
  ahadit(
    hadit:
        " عن النبي (صلى الله عليه وسلم) قال : ' سيد الاستغفار أن يقول العبد : اللهم أنت ربي لا إله إلا أنت خلقتني وأنا عبدك ، وأنا على عهدك ووعدك ما استطعت ، أعوذ بك من شر ما صنعت ، أبوء لك بنعمتك علي ، وأبوء بذنبي ، فاغفر لي فإنه لا يغفر الذنوب إلا أنت ، من قالها بالنهار موقنا بها فمات من يومه قبل أن يمسي فهو من أهل الجنة ، ومن قالها من الليل وهو موقن بها فمات قبل أن يصبح فهو من أهل الجنة ' قلت : أبوء ",
    mosnad:
        "مرفوع | حديث رقم : 5522 \n مجلد رقم : 8 | صفحة رقم : 279 \n كتاب الاستعادة - الاستعادة من شر ما صنع \n وذكر الاختلاف على عبد الله بن بريدة فيه",
    hokm: "",
  ),
  ahadit(
    hadit:
        "  عن ابن عمر رضي الله تعالى عنه قال : ' كنا نعد لرسول الله (صلى الله عليه وسلم) في المجلس الواحد مائة مرة : رب اغفر لي وتب علي إنك أنت التواب الرحيم ' ",
    mosnad:
        "مرفوع | حديث رقم : 1516 \n مجلد رقم : 2 | صفحة رقم : 2 \n صفحة رقم : 120 | كتاب الصلاة \n باب - في الاستغفار",
    hokm: "",
  ),
  ahadit(
    hadit:
        " قال رسول الله (صلى الله عليه وسلم) :  من لزم الاستغفار جعل الله له من كل ضيق مخرجا ومن كل هم فرجا ، ورزقه من حيث لا يحتسب ",
    mosnad:
        " مرفوع | حديث رقم : 1518 \n مجلد رقم : 2 | صفحة رقم : 121 \n كتاب الصلاة - باب : في الاستغفار ",
    hokm: "حكم الحديث : ضعيف",
  ),
  ahadit(
    hadit:
        " قال رسول الله صلى الله عليه وسلم: ' والذي نفسي بيده لو لم تذنبوا لذهب الله بكم ، ولجاء بقوم يذنبون فيستغفرون الله تعالى فيغفر لهم ' ",
    mosnad:
        " مرفوع | حديث رقم : 2749 \n مجلد رقم : 8 | صفحة رقم : 94 \n كتاب : التوبة \n باب: سقوط الذنوب بالاستغفار توبة ",
    hokm: "",
  ),
  ahadit(
    hadit:
        " عن رسول الله صلى الله عليه وسلم يقول : ' قال الله تعالى : يا بن آدم ، إنك ما دعوتني ورجوتني غفرت لك ما كان منك ولا أبالي ، يا بن آدم لو بلغت ذنوبك عنان السماء ثم استغفرتني غفرت لك ، يابن آدم لو أتيتني بقراب الأرض خطايا ثم أتيتني لا تشرك بي شيئا لاتيتك بقرابها مغفرة ' ",
    mosnad:
        " قدسي | حديث رقم : 3540 \n مجلد رقم : 5 | صفحة رقم : 509 \n أبواب الدعوات عن رسول الله صلى الله علايه وسلم ",
    hokm: "",
  ),
  ahadit(
    hadit:
        " قال رسول الله صلى الله عليه وسلم : ' طوبى لمن وجد في صحيفته استغفارا كثيرا ' ",
    mosnad:
        " مرفوع | حديث رقم : 3818 | مجلد رقم : 5 | صفحة رقم : 347 | كتاب الادب - باب : الاستغفار ",
    hokm: "",
  ),
];

List<ahadit> jabr = [
  ahadit(
    hadit:
        "قال تعالى : 'وَإِذَا سَأَلَكَ عِبَادِي عَنِّي فَإِنِّي قَرِيبٌ أُجِيبُ دَعْوَةَ الدَّاعِ إِذَا دَعَانِ فَلْيَسْتَجِيبُوا لِي وَلْيُؤْمِنُوا بِي لَعَلَّهُمْ يَرْشُدُون'",
    mosnad: "الاية : 186",
    hokm: "البقرة",
  ),
  ahadit(
    hadit:
        " قال تعالى : 'الَّذِينَ يُنْفِقُونَ فِي السَّرَّاءِ وَالضَّرَّاءِ وَالْكَاظِمِينَ الْغَيْظَ وَالْعَافِينَ عَنِ النَّاسِ وَاللَّهُ يُحِبُّ الْمُحْسِنِين' ",
    mosnad: " الاية : 134 ",
    hokm: "آل عمران",
  ),
  ahadit(
    hadit:
        "قال تعالى : 'وَعَسَى أَنْ تَكْرَهُوا شَيْئًا وَهُوَ خَيْرٌ لَكُمْ وَعَسَى أَنْ تُحِبُّوا شَيْئًا وَهُوَ شَرٌّ لَكُمْ وَاللَّهُ يَعْلَمُ وَأَنْتُمْ لَا تَعْلَمُون'",
    mosnad: "الاية : 216",
    hokm: "البقرة",
  ),
  ahadit(
    hadit:
        "قال تعالى : 'وَلِلَّهِ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ وَكَانَ اللَّهُ بِكُلِّ شَيْءٍ مُحِيطًا'",
    mosnad: "الاية : 126",
    hokm: "النساء",
  ),
  ahadit(
    hadit:
        " قال تعالى : 'وَأَنَّ سَعْيَهُ سَوْفَ يُرَى* ثُمَّ يُجْزَاهُ الْجَزَاءَ الْأَوْفَى' ",
    mosnad: "الاية : 40-41",
    hokm: "النجم",
  ),
  ahadit(
    hadit:
        " قال رسول الله صلى الله عليه وسلم : 'مَن نَفَّسَ عن مُؤْمِنٍ كُرْبَةً مِن كُرَبِ الدُّنْيَا، نَفَّسَ اللَّهُ عنْه كُرْبَةً مِن كُرَبِ يَومِ القِيَامَةِ، وَمَن يَسَّرَ علَى مُعْسِرٍ، يَسَّرَ اللَّهُ عليه في الدُّنْيَا وَالآخِرَةِ، وَمَن سَتَرَ مُسْلِمًا، سَتَرَهُ اللَّهُ في الدُّنْيَا وَالآخِرَةِ، وَاللَّهُ في عَوْنِ العَبْدِ ما كانَ العَبْدُ في عَوْنِ أَخِيه' ",
    mosnad:
        "مرفوع | حديث رقم : 2699 \n مجلد رقم : 8 | صفحة رقم : 71 \n كتاب : الذكر والدعاء والتوبة والاستغفار \n باب : فضل الاجتماع على تلاوة القرآن",
    hokm: "",
  ),
  ahadit(
    hadit:
        " قال صلى الله عليه وسلم : 'تبسُّمُكَ في وجْهِ أخيكَ لَكَ صدقةٌ، وأمرُكَ بالمعروفِ ونَهيُكَ عنِ المنْكرِ صدقةٌ، وإرشادُكَ الرَّجلَ في أرضِ الضَّلالِ لَكَ صدقةٌ، وبصرُكَ للرَّجلِ الرَّديءِ البصرِ لَكَ صدقةٌ، وإماطتُكَ الحجرَ والشَّوْكَ والعظمَ عنِ الطَّريقِ لَكَ صدقةٌ، وإفراغُكَ من دلوِكَ في دلوِ أخيكَ لَكَ صدقة' ",
    mosnad:
        " مرفوع | حديث رقم : 1956 \n مجلد رقم : 3 | صفحة رقم : 506 \n أبواب البر والصلة عن رسول الله صلى الله عليه وسلم \n باب : ما جاء في صنائع المعروف ",
    hokm: "",
  ),
  ahadit(
    hadit:
        " قال صلى الله عليه وسلم : ' الراحمون يرحمُهم الرحمنُ، ارحموا من في الأرضِ يرحمْكم من في السماء' ",
    mosnad:
        " مرفوع | حديث رقم : 4941 \n مجلد رقم : 5 | صفحة رقم : 146 \n أول كتاب الادب \n باب : في الرحمة ",
    hokm: "",
  ),
  ahadit(
    hadit:
        " قال رسول الله صلى الله عليه وسلم : ' إنَّ اللَّهَ قالَ: مَن عادَى لي وَلِيًّا فقَدْ آذَنْتُهُ بالحَرْبِ، وما تَقَرَّبَ إلَيَّ عَبْدِي بشَيءٍ أحَبَّ إلَيَّ ممَّا افْتَرَضْتُ عليه، وما يَزالُ عَبْدِي يَتَقَرَّبُ إلَيَّ بالنَّوافِلِ حتَّى أُحِبَّهُ، فإذا أحْبَبْتُهُ، كُنْتُ سَمْعَهُ الَّذي يَسْمَعُ به، وبَصَرَهُ الَّذي يُبْصِرُ به، ويَدَهُ الَّتي يَبْطِشُ بها، ورِجْلَهُ الَّتي يَمْشِي بها، وإنْ سَأَلَنِي لَأُعْطِيَنَّهُ، ولَئِنِ اسْتَعاذَنِي لَأُعِيذَنَّه ' ",
    mosnad:
        "قدسي | حديث رقم : 6504 \n مجلد رقم : 8 | صفحة رقم : 105 \n كتاب : الرفاق - باب التواضع",
    hokm: "",
  ),
];
List<ahadit> hayra = [
  ahadit(
    hadit:
        " كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُعَلِّمُنَا الِاسْتِخَارَةَ فِي الْأُمُورِ كَمَا يُعَلِّمُنَا السُّورَةَ مِنَ الْقُرْآنِ، يَقُولُ : ' إِذَا هَمَّ أَحَدُكُمْ بِالْأَمْرِ فَلْيَرْكَعْ رَكْعَتَيْنِ مِنْ غَيْرِ الْفَرِيضَةِ، ثُمَّ لِيَقُلِ : اللَّهُمَّ إِنِّي أَسْتَخِيرُكَ بِعِلْمِكَ وَأَسْتَقْدِرُكَ بِقُدْرَتِكَ، وَأَسْأَلُكَ مِنْ فَضْلِكَ الْعَظِيمِ، فَإِنَّكَ تَقْدِرُ وَلَا أَقْدِرُ، وَتَعْلَمُ وَلَا أَعْلَمُ، وَأَنْتَ عَلَّامُ الْغُيُوبِ، اللَّهُمَّ إِنْ كُنْتَ تَعْلَمُ أَنَّ هَذَا الْأَمْرَ خَيْرٌ لِي فِي دِينِي، وَمَعَاشِي، وَعَاقِبَةِ أَمْرِي ' أَوْ قَالَ : ' عَاجِلِ أَمْرِي وَآجِلِهِ، فَاقْدُرْهُ لِي وَيَسِّرْهُ لِي ثُمَّ بَارِكْ لِي فِيهِ، وَإِنْ كُنْتَ تَعْلَمُ أَنَّ هَذَا الْأَمْرَ شَرٌّ لِي فِي دِينِي وَمَعَاشِي وَعَاقِبَةِ أَمْرِي ' أَوْ قَالَ : ' فِي عَاجِلِ أَمْرِي وَآجِلِهِ، فَاصْرِفْهُ عَنِّي وَاصْرِفْنِي عَنْهُ، وَاقْدُرْ لِي الْخَيْرَ حَيْثُ كَانَ، ثُمَّ أَرْضِنِي '. قَالَ : ' وَيُسَمِّي حَاجَتَهُ ' ",
    mosnad:
        "مرفوع | حديث رقم :1162 \n مجلد رقم : 2 | صفحة رقم :118 \n كتاب التوحيد \n باب قول الله تعالى : قل هو القادر",
    hokm: "",
  ),
  ahadit(
    hadit:
        " قال تعالى : 'وَجَعَلْنَا مِنْهُمْ أَئِمَّةً يَهْدُونَ بِأَمْرِنَا لَمَّا صَبَرُوا وَكَانُوا بِآَيَاتِنَا يُوقِنُونَ' ",
    mosnad: " الاية :24",
    hokm: "السجدة",
  ),
  ahadit(
    hadit:
        " قال رسول الله صلى الله عليه وسلم : 'وسلوا الله اليقين والمعافاة، فإنه لم يؤت أحد بعد اليقين خيرا من المعافاة' ",
    mosnad: "رواه أحمد وصححه الألباني في صحيح الجامع",
    hokm: "",
  ),
  ahadit(
    hadit:
        " قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : ' مَثَلُ أُمَّتِي مَثَلُ الْمَطَرِ ؛ لَا يُدْرَى أَوَّلُهُ خَيْرٌ، أَمْ آخِرُهُ ' ",
    mosnad:
        " مرفوع | حديث رقم : 2869 \n مجلد رقم : 4 | صفحة رقم : 549 \n أبواب الامثال عن رسول الله صلى الله عليه وسلم ",
    hokm: "",
  ),
];

List<ahadit> kasal = [
  ahadit(
    hadit:
        " رسول الله صلى الله عليه وسلم قال: ' يَعْقِد الشَّيطان على قافية  رأس أحدكم -إذا هو نام- ثلاث عقد، يضرب كلَّ عقدة: عليك ليلٌ طويلٌ فارقد، فإن استيقظ فذكر الله انحلَّت عقدةٌ، فإن توضَّأ انحلَّت عقدةٌ، فإن صلَّى انحلَّت عقدةٌ، فأصبح نشيطًا طيِّب النَّفس، وإلَّا أصبح خبيث النَّفس كسلان ' ",
    mosnad:
        " مرفوع | حديث رقم : 1142 \n مجلد رقم : 2 | صفحة رقم : 52 \n باب التجهد بالليل \n باب عقد الشيطان على قافية الرأس",
    hokm: "",
  ),
  ahadit(
    hadit:
        "  رسول الله صلى الله عليه وسلم قال: ' والذي نفسي بيده لأن يأخذ أحدكم حبله فيحتطب على ظهره خير له من أن يأتي رجلاً فيسأله أعطاه أو منعه ' ",
    mosnad:
        "مرفوع | حديث رقم : 2589 \n مجلد رقم : 5 | صفحة رقم : 96 \n كتاب الزكاة - الاستعفاف عن المسألة",
    hokm: "",
  ),
  ahadit(
    hadit:
        " قال تعالى : 'إِنَّ الْمُنَافِقِينَ يُخَادِعُونَ اللَّهَ وَهُوَ خَادِعُهُمْ وَإِذَا قَامُوا إِلَى الصَّلَاةِ قَامُوا كُسَالَى يُرَاءُونَ النَّاسَ وَلَا يَذْكُرُونَ اللَّهَ إِلَّا قَلِيلًا' ",
    mosnad: "الاية : 142",
    hokm: "النساء",
  ),
  ahadit(
    hadit:
        " كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ : ' اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْعَجْزِ وَالْكَسَلِ، وَالْجُبْنِ وَالْهَرَمِ، وَأَعُوذُ بِكَ مِنْ فِتْنَةِ الْمَحْيَا وَالْمَمَاتِ، وَأَعُوذُ بِكَ مِنْ عَذَابِ الْقَبْرِ ' ",
    mosnad:
        "مرفوع | حديث رقم : 2823 \n مجلد رقم : 4 | صفحة رقم :23 \n كتاب الجهاد والسير \n باب ما يتعوذ من الجبن",
    hokm: "",
  ),
  ahadit(
    hadit:
        " وصف الله تعالى عباده المؤمنين بقوله: ' ولَئِكَ يُسَارِعُونَ فِي الْخَيْرَاتِ وَهُمْ لَهَا سَابِقُون ' ",
    mosnad: "الاية : 61",
    hokm: "المؤمنون",
  ),
  ahadit(
    hadit:
        " قال تعالى : 'وَمَا مَنَعَهُمْ أَن تُقْبَلَ مِنْهُمْ نَفَقَاتُهُمْ إِلاَّ أَنَّهُمْ كَفَرُواْ بِاللّهِ وَبِرَسُولِهِ وَلاَ يَأْتُونَ الصَّلاَةَ إِلاَّ وَهُمْ كُسَالَى وَلاَ يُنفِقُونَ إِلاَّ وَهُمْ كَارِهُونَ ' ",
    mosnad: "الاية :54",
    hokm: "التوبة",
  ),
  ahadit(
    hadit: " قال رسول الله صلى الله عليه وسلم: 'اللهم بارك لأمتي في بكورها.'",
    mosnad:
        "مرفوع | حديث رقم : 1212 \n مجلد رقم : 2 | صفحة رقم : 500 \n أبواب : البيوع عن رسول الله صلى الله عليه وسلم \n باب : ما جاء في التبكير بالتجارة",
    hokm: "",
  ),
  ahadit(
    hadit:
        " قال رسول الله صلى الله عليه وسلم: 'قال الله: يؤذيني ابن آدم، يسب الدهر وأنا الدهر، بيدي الأمر، أقلب الليل والنهار' ",
    mosnad:
        "قدسي | حديث رقم : 4826 \n مجلد رقم : 6 | صفحة رقم : 133 \n كتاب التفسير - سورة الجاثية \n باب : ومايهلكنا إلا الدهر",
    hokm: "",
  ),
  ahadit(
    hadit:
        " قال رسول الله صلى الله عليه وسلم: ' إِنَّما العلمُ بِالتَّعَلُّمِ ، و إِنَّما الحِلْمُ بِالتَّحَلُّمِ ، و مَنْ يَتَحَرَّ الخَيْرَ يُعْطَهُ ، و مَنْ يَتَّقِ الشَّرَّ يُوقَهُ.' ",
    mosnad:
        "الراوي : أبو هريرة | المحدث : الألباني \n المصدر : السلسلة الصحيحة | الصفحة أو الرقم : 342 \n خلاصة حكم المحدث : إسناده حسن أو قريب منه",
    hokm: "",
  ),
];

List<ahadit> wahda = [
  ahadit(
    hadit:
        " قال الله تعالى: 'وَإِذَا سَأَلَكَ عِبَادِي عَنِّي فَإِنِّي قَرِيبٌ أُجِيبُ دَعْوَةَ الدَّاعِ إِذَا دَعَانِ فَلْيَسْتَجِيبُوا لِي وَلْيُؤْمِنُوا بِي لَعَلَّهُمْ يَرْشُدُونَ' ",
    mosnad: "الاية : 186",
    hokm: "البقرة",
  ),
  ahadit(
    hadit:
        " قال تعالى: ' أَمَّن يُجِيبُ الْمُضْطَرَّ إِذَا دَعَاهُ وَيَكْشِفُ السُّوءَ وَيَجْعَلُكُمْ خُلَفَاء الْأَرْضِ أَإِلَهٌ مَّعَ اللَّهِ قَلِيلًا مَّا تَذَكَّرُونَ' ",
    mosnad: "الاية : 62",
    hokm: "النمل",
  ),
  ahadit(
    hadit:
        " قال عز من قائل: 'وَلاَ تَيْأَسُواْ مِن رَّوْحِ ٱللَّهِ إِنَّهُ لاَ يَيْأَسُ مِن رَّوْحِ ٱللَّهِ إِلاَّ ٱلْقَوْمُ ٱلْكَافِرُونَ' ",
    mosnad: "الاية : 87",
    hokm: "يوسف",
  ),
  ahadit(
    hadit: "قال تعالى 'سَيَجْعَلُ اللَّـهُ بَعْدَ عُسْرٍ يُسْرًا'",
    mosnad: "الاية : 7",
    hokm: "الطلاق",
  ),
  ahadit(
    hadit: "",
    mosnad: "",
    hokm: "",
  ),
  ahadit(
    hadit:
        " قال تعالى ' هُوَ الَّذي يُسَيِّرُكُم فِي البَرِّ وَالبَحرِ حَتّى إِذا كُنتُم فِي الفُلكِ وَجَرَينَ بِهِم بِريحٍ طَيِّبَةٍ وَفَرِحوا بِها جاءَتها ريحٌ عاصِفٌ وَجاءَهُمُ المَوجُ مِن كُلِّ مَكانٍ وَظَنّوا أَنَّهُم أُحيطَ بِهِم دَعَوُا اللَّـهَ مُخلِصينَ لَهُ الدّينَ لَئِن أَنجَيتَنا مِن هـذِهِ لَنَكونَنَّ مِنَ الشّاكِرين' ",
    mosnad: " الاية : 22 ",
    hokm: " يونس ",
  ),
  ahadit(
    hadit: "",
    mosnad: "",
    hokm: "",
  ),
];

List<ahadit> yaess = [
  ahadit(
    hadit:
        "قال تعالى : 'إِنَّمَا يُوَفَّى الصَّابِرُونَ أَجْرَهُم بِغَيْرِ حِسَابٍ'",
    mosnad: "الاية : 10",
    hokm: "الزمر",
  ),
  ahadit(
    hadit:
        "قال تعالى : 'ادْفَعْ بِالَّتِي هِيَ أَحْسَنُ فَإِذَا الَّذِي بَيْنَكَ وَبَيْنَهُ عَدَاوَةٌ كَأَنَّهُ وَلِيٌّ حَمِيمٌ * وَمَا يُلَقَّاهَا إِلَّا الَّذِينَ صَبَرُوا وَمَا يُلَقَّاهَا إِلَّا ذُو حَظٍّ عَظِيمٍ'",
    mosnad: "الاية : 34-35",
    hokm: "فصلت",
  ),
  ahadit(
    hadit:
        "قال تعالى : 'وَلَنَبْلُوَنَّكُمْ بِشَيْءٍ مِنَ الْخَوْفِ وَالْجُوعِ وَنَقْصٍ مِنَ الْأَمْوَالِ وَالْأَنْفُسِ وَالثَّمَرَاتِ وَبَشِّرِ الصَّابِرِينَ * الَّذِينَ إِذَا أَصَابَتْهُمْ مُصِيبَةٌ قَالُوا إِنَّا لِلَّهِ وَإِنَّا إِلَيْهِ رَاجِعُونَ * أُولَئِكَ عَلَيْهِمْ صَلَوَاتٌ مِنْ رَبِّهِمْ وَرَحْمَةٌ وَأُولَئِكَ هُمُ الْمُهْتَدُونَ'",
    mosnad: "الاية : 155-157",
    hokm: "البقرة",
  ),
  ahadit(
    hadit:
        "قال تعالى : ' وَنَبْلُوكُمْ بِالشَّرِّ وَالْخَيْرِ فِتْنَةً وَإِلَيْنَا تُرْجَعُونَ'",
    mosnad: "الاية : 35",
    hokm: "الانبياء",
  ),
  ahadit(
    hadit:
        "قال تعالى : 'وَلَقَدْ أَرْسَلْنَا إِلَى أُمَمٍ مِنْ قَبْلِكَ فَأَخَذْنَاهُمْ بِالْبَأْسَاءِ وَالضَّرَّاءِ لَعَلَّهُمْ يَتَضَرَّعُونَ'",
    mosnad: "الاية : 42",
    hokm: "الانعام",
  ),
  ahadit(
    hadit:
        "ويقول النبي صلى الله عليه وسلم: ما يصيب المسلم من نصب، ولا وصب، ولا هم، ولا حزن، ولا أذى، ولا غم حتى الشوكة يُشاكها، إلا كفرَّ الله بها من خطاياه",
    mosnad:
        "مرفوع | مجلد :7 \n صفحة : 114 | حديث : 5641,5642 \n كتاب المرضى | باب ماجاء في كفارة المرض",
    hokm: "",
  ),
  ahadit(
    hadit:
        "عن النبي صلى الله عليه وسلم قال: عجباً لأمر المؤمن، إن أمره كله خير، وليس ذاك لأحدٍ إلا للمؤمن، إن أصابته سراء شكر فكان خيراً له، وإن أصابته ضراء صبر، فكان خيراً له",
    mosnad:
        "مرفوع | مجلد : 8 \n صفحة رقم : 227 | حديث : 2999 \n كتاب : الزهد والرقائق \n باب : المؤمن أمره كله خير ",
    hokm: "",
  ),
  ahadit(
    hadit:
        "يقول صلى الله عليه وسلم: إن عِظَم الجزاء من عِظَم البلاء، وإن الله إذا أحب قوماً ابتلاهم، فمن رضي فله الرضا، ومن سخط فله السخط",
    mosnad:
        "مرفوع | مجلد رقم : 4 \n صفحة رقم : 202 | حديث : 2396 \n أبواب الزهد عن رسول الله صلى الله عليه وسلم \n باب : ما جاء في الصبر على البلاء",
    hokm: "",
  ),
  ahadit(
    hadit:
        "قال رسول الله صلى الله عليه وسلم : 'لا يتمنى أحدكم الموت لضر أصابه، إما محسناً فلعله أن يزداد خيراً، وإما مسيئاً فلعله أن يستعتب'",
    mosnad:
        "مرفوع | مجلد : 9 \n صفحة : 84 | حديث : 7235 \n كتاب التمني \n باب ما يكره من التمني",
    hokm: "",
  ),
  ahadit(
    hadit:
        "يقول الله سبحانه وتعالى: وَمَنْ يَتَّقِ اللَّهَ يَجْعَلْ لَهُ مَخْرَجًا  * وَيَرْزُقْهُ مِنْ حَيْثُ لَا يَحْتَسِبُ",
    mosnad: "الاية : 3-2",
    hokm: "الطلاق",
  ),
  ahadit(
    hadit:
        "قال سبحانه وتعالى : ' وَمَنْ يَتَّقِ اللَّهَ يَجْعَلْ لَهُ مِنْ أَمْرِهِ يُسْرًا * ذَلِكَ أَمْرُ اللَّهِ أَنْزَلَهُ إِلَيْكُمْ وَمَنْ يَتَّقِ اللَّهَ يُكَفِّرْ عَنْهُ سَيِّئَاتِهِ وَيُعْظِمْ لَهُ أَجْرًا'",
    mosnad: "الاية : 4-5",
    hokm: "الطلاق",
  ),
  ahadit(
    hadit:
        "يقول سبحانه وتعالى: وَلَوْ أَنَّ أَهْلَ الْقُرَى آمَنُوا وَاتَّقَوْا لَفَتَحْنَا عَلَيْهِمْ بَرَكَاتٍ مِنَ السَّمَاءِ وَالْأَرْضِ وَلَكِنْ كَذَّبُوا فَأَخَذْنَاهُمْ بِمَا كَانُوا يَكْسِبُونَ ",
    mosnad: "الاية : 96",
    hokm: "الأعراف",
  ),
  ahadit(
    hadit:
        "يقول سبحانه وتعالى: يَا أَيُّهَا الَّذِينَ آمَنُوا اتَّقُوا اللَّهَ وَقُولُوا قَوْلًا سَدِيدًا * يُصْلِحْ لَكُمْ أَعْمَالَكُمْ وَيَغْفِرْ لَكُمْ ذُنُوبَكُمْ وَمَنْ يُطِعِ اللَّهَ وَرَسُولَهُ فَقَدْ فَازَ فَوْزًا عَظِيمًا ",
    mosnad: "الاية : 70-71",
    hokm: "الاحزاب",
  ),
  ahadit(
    hadit:
        " يا حي يا قيوم برحمتك أستغيث، أصلح لي شأني كله، ولا تكلني إلى نفسي طرفة عين",
    mosnad: "",
    hokm: "",
  ),
];

List<ahadit> marad = [
  ahadit(
    hadit:
        "قوله صلى الله عليه وسلم: أذهب البأس رب الناس، واشف أنت الشافي، لا شفاء إلا شفاؤك شفاءً لا يغادر سقماً",
    mosnad: "",
    hokm: "",
  ),
  ahadit(
    hadit:
        " اللهم إني أسألك من عظيم لطفك وكرمك وسترك الجميل أن تشفيه وتمده بالصحة والعافية. اللهم إنا نسألك بأسمائك الحسنى، وبصفاتك العلا وبرحمتك التي وسعت كل شيء، أن تمن علينا بالشفاء العاجل، وألا تدع فينا جرحا إلا داويته، ولا ألما إلا سكنته، ولا مرضا إلا شفيته، وألبسنا ثوب الصحة والعافية عاجلا غير آجلا، وشافنا وعافنا واعف عنا، واشملنا بعطفك ومغفرتك، وتولنا برحمتك يا أرحم الراحمين ",
    mosnad: "",
    hokm: "",
  ),
  ahadit(
    hadit:
        " لهي أذهب البأس رب الناس، اشف وأنت الشافي، لا شفاء إلا شفاؤك، شفاء لا يغادر سقما، أذهب البأس رب الناس، بيدك الشفاء، لا كاشف له إلا أنت يارب العالمين، اللهم إني أسألك من عظيم لطفك وكرمك وسترك الجميل، أن تشفيه وتمده بالصحة والعافية، لا ملجأ ولا منجا منك إلا إليك، إنك على كل شيء قدير ",
    mosnad: "",
    hokm: "",
  ),
  ahadit(
    hadit:
        " اللهم يا مسهل الشديد، وملين الحديد، ويا منجز الوعيد ويا من توكل كل يوم في أمر جديد، أخرج مرضانا ومرضى المسلمين من حلق الضيق إلى أوسع الطريق. اللهم ألبسه ثوب الصحة والعافية عاجلا غير آجل يا أرحم الراحمين. أسأل الله العظيم رب العرش العظيم أن يشفيك وسائر مرضى المسلمين ",
    mosnad: "",
    hokm: "",
  ),
  ahadit(
    hadit:
        "قال تعالى 'اللَّهُ لَا إِلَٰهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ ۚ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ ۚ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۗ مَن ذَا الَّذِي يَشْفَعُ عِندَهُ إِلَّا بِإِذْنِهِ ۚ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ ۖ وَلَا يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلَّا بِمَا شَاءَ ۚ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ ۖ وَلَا يؤوده حِفْظُهُمَا ۚ وَهُوَ الْعَلِيُّ الْعَظِيمُ'",
    mosnad: "آية الكرسي",
    hokm: "",
  ),
  ahadit(
    hadit:
        " ضَعْ يَدَكَ علَى الذي تَأَلَّمَ مِن جَسَدِكَ، وَقُلْ باسْمِ اللهِ ثَلَاثًا، وَقُلْ سَبْعَ مَرَّاتٍ أَعُوذُ باللَّهِ وَقُدْرَتِهِ مِن شَرِّ ما أَجِدُ وَأُحَاذِرُ ",
    mosnad: "",
    hokm: "",
  ),
  ahadit(
    hadit:
        " قال تعالى 'الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ  الرَّحْمَنِ الرَّحِيمِ  مَالِكِ يَوْمِ الدِّينِ  إِيَّاكَ نَعْبُدُ وَإِيَّاكَ نَسْتَعِينُ  اهْدِنَا الصِّرَاطَ الْمُسْتَقِيمَ صِرَاطَ الَّذِينَ أَنْعَمْتَ عَلَيْهِمْ غَيْرِ الْمَغْضُوبِ عَلَيْهِمْ وَلَا الضَّالِّينَ ' ",
    mosnad: "الأية : 1-7",
    hokm: "الفاتحة",
  ),
  ahadit(
    hadit:
        "قال تعالى ' يَا أَيُّهَا النَّاسُ قَدْ جَاءتْكُم مَّوْعِظَةٌ مِّن رَّبِّكُمْ وَشفَاء لِّمَا فِي الصُّدُورِ وَهُدًى وَرَحْمَةٌ لِّلْمُؤْمِنِينَ '",
    mosnad: "الاية : 57",
    hokm: "يونس",
  ),
  ahadit(
    hadit:
        "قال تعالى 'ثُمَّ كُلِي مِن كُلِّ الثَّمَرَاتِ فَاسْلُكِي سُبُلَ رَبِّكِ ذُلُلاً يَخْرُجُ مِن بُطُونِهَا شَرَابٌ مُّخْتَلِفٌ أَلْوَانُهُ فِيهِ شِفَاء لِلنَّاسِ إِنَّ فِي ذَلِكَ لآيَةً لِّقَوْمٍ يَتَفَكَّرُونَ'",
    mosnad: " الاية :82 ",
    hokm: "الإسراء",
  ),
  ahadit(
    hadit: "قال تعالى 'وَإِذَا مَرِضْتُ فَهُوَ يَشْفِينِ'",
    mosnad: "الاية : 80",
    hokm: "الشعراء",
  ),
  ahadit(
    hadit:
        " قال تعالى 'وَإِلَـهُكُمْ إِلَهٌ وَاحِدٌ لاَّ إِلَهَ إِلاَّ هُوَ الرَّحْمَنُ الرَّحِيمُ إِنَّ فِي خَلْقِ السَّمَاوَاتِ وَالأَرْضِوَاخْتِلاَفِ اللَّيْلِ وَالنَّهَارِ وَالْفُلْكِ الَّتِي تَجْرِي فِي الْبَحْرِ بِمَا يَنفَعُ النَّاسَ وَمَا أَنزَلَ اللّهُ مِنَالسَّمَاء مِن مَّاء فَأَحْيَا بِهِ الأرْضَ بَعْدَ مَوْتِهَا وَبَثَّ فِيهَا مِن كُلِّ دَآبَّةٍ وَتَصْرِيفِ الرِّيَاحِ وَالسَّحَابِالْمُسَخِّرِ بَيْنَ السَّمَاء وَالأَرْضِ لآيَاتٍ لِّقَوْمٍ يَعْقِلُونَ وَمِنَ النَّاسِ مَن يَتَّخِذُ مِن دُونِ اللّهِأَندَاداً يُحِبُّونَهُمْ كَحُبِّ اللّهِ وَالَّذِينَ آمَنُواْ أَشَدُّ حُبًّا لِّلّهِ وَلَوْ يَرَى الَّذِينَ ظَلَمُواْ إِذْ يَرَوْنَ الْعَذَابَ أَنَّالْقُوَّةَ لِلّهِ جَمِيعاً وَأَنَّ اللّهَ شَدِيدُ الْعَذَابِ' ",
    mosnad: "الآية : 163 - 165",
    hokm: "البقرة",
  ),
  ahadit(
    hadit:
        "قال تعالى 'وَإِلَـهُكُمْ إِلَهٌ وَاحِدٌ لاَّ إِلَهَ إِلاَّ هُوَ الرَّحْمَنُ الرَّحِيمُ إِنَّ فِي خَلْقِ السَّمَاوَاتِ وَالأَرْضِوَاخْتِلاَفِ اللَّيْلِ وَالنَّهَارِ وَالْفُلْكِ الَّتِي تَجْرِي فِي الْبَحْرِ بِمَا يَنفَعُ النَّاسَ وَمَا أَنزَلَ اللّهُ مِنَالسَّمَاء مِن مَّاء فَأَحْيَا بِهِ الأرْضَ بَعْدَ مَوْتِهَا وَبَثَّ فِيهَا مِن كُلِّ دَآبَّةٍ وَتَصْرِيفِ الرِّيَاحِ وَالسَّحَابِالْمُسَخِّرِ بَيْنَ السَّمَاء وَالأَرْضِ لآيَاتٍ لِّقَوْمٍ يَعْقِلُونَ وَمِنَ النَّاسِ مَن يَتَّخِذُ مِن دُونِ اللّهِأَندَاداً يُحِبُّونَهُمْ كَحُبِّ اللّهِ وَالَّذِينَ آمَنُواْ أَشَدُّ حُبًّا لِّلّهِ وَلَوْ يَرَى الَّذِينَ ظَلَمُواْ إِذْ يَرَوْنَ الْعَذَابَ أَنَّالْقُوَّةَ لِلّهِ جَمِيعاً وَأَنَّ اللّهَ شَدِيدُ الْعَذَابِ'",
    mosnad: "الاية 262- 265",
    hokm: "البقرة",
  ),
  ahadit(
    hadit:
        "قال رسول الله صلى الله عليه وسلم : 'أَذْهِبِ الْبَاسَ رَبَّ النَّاسِ، وَاشْفِ أَنْتَ الشَّافِي، لاَ شِفَاءَ إِلاَّ شِفَاؤُكَ، شِفَاءً لاَ يُغَادِرُ سَقَمًا' ",
    mosnad:
        "مرفوع | مجلد : 7 \n صفحة : 121 | حديث : 5675 \n كتاب المرضى \n باب الدعاء العائد للمريض",
    hokm: "",
  ),
  ahadit(
    hadit:
        "قال رسول الله صلى الله عليه وسلم :'ضَعْ يَدَكَ عَلَى الَّذِي تَأَلَّمَ مِنْ جَسَدِكَ وَقُلْ: بِاسْمِ اللهِ، ثَلاَثًا، وَقُلْ سَبْعَ مَرَّات: أَعُوذُ بِاللهِ وَقُدْرَتِهِ مِنْ شَرِّ مَا أَجِدُ وَأُحَاذِرُ'",
    mosnad:
        "مرفوع | مجلد رقم : 7 \n صفحة : 20 | حديث : 2202 \n كتاب : السلام \nباب - استحباب وضع يده على موضع الألم مع الدعاء",
    hokm: "",
  ),
];
List<ahadit> choker = [
  ahadit(
    hadit:
        "قال تعالى :'الحمد لله الذي خلق السماوات والأرض وجعل الظلمات والنور ثم الذين كفروا بربهم يعدلون'",
    mosnad: "الاية : 1",
    hokm: "الأنعام",
  ),
  ahadit(
    hadit:
        "وقال تعالى: 'وترى الملائكة حافين من حول العرش يسبحون بحمد ربهم وقضي بينهم بالحق وقيل الحمد لله رب العالمين'",
    mosnad: "الاية : 75",
    hokm: "الزمر",
  ),
  ahadit(
    hadit:
        " وقال تعالى: 'وهو الله لا إله إلا هو له الحمد في الأولى والآخرة وله الحكم وإليه ترجعون'",
    mosnad: "الاية : 70",
    hokm: "القصص",
  ),
  ahadit(
    hadit:
        "قال رسول الله صلى عليه وسلم : 'كل أمر ذي بال لا يبدأ فيه بالحمد لله فهو أقطع'",
    mosnad:
        "مرفوع | مجلد : 3 \n صفحة : 337 | حديث : 1894 \n كتاب النكاح \n باب : خطبة النكاح",
    hokm: "",
  ),
  ahadit(
    hadit:
        " قال رسول الله  صلى الله عليه وسلم : «إذا مات ولد العبد قال الله تعالى لملائكته: قبضتم ولد عبدي؟ فيقولون: نعم، فيقول: قبضتم ثمرة فؤاده؟ فيقولون: نعم، فيقول: ماذا قال عبدي؟ فيقولون: حمدك واسترجع، فيقول الله تعالى: ابنوا لعبدي بيتا في الجنة، وسموه بيت الحمد ",
    mosnad:
        "قدسي | مجلد : 2 \n صفحة : 329 | حديث : 1021 \n أبواب الجنائز عن رسول الله صلى الله عليه وسلم \n باب : فضل المصيبة إذا احتسب ",
    hokm: "",
  ),
  ahadit(
    hadit:
        " قال رسول الله صلى الله عليه وسلم: 'إن الله ليرضى عن العبد يأكل الأكلة، فيحمده عليها، ويشرب الشربة، فيحمده عليها' ",
    mosnad:
        "مرفوع | مجلد : 8 \n صفحة : 87 | حديث : 2734 \n كتاب : الذكر والدعاء والتوبة والاستغفار \n باب : استحباب حمد الله تعالى بعد الأكل والشرب ",
    hokm: "",
  ),
  ahadit(
    hadit:
        "قال تعالى : ' فَاذْكُرُونِي أَذْكُرْكُمْ وَاشْكُرُوا لِي وَلَا تَكْفُرُونِ'",
    mosnad: "الاية : 152",
    hokm: "البقرة ",
  ),
  ahadit(
    hadit:
        " قال تعالى : 'يَا أَيُّهَا الَّذِينَ آمَنُوا كُلُوا مِنْ طَيِّبَاتِ مَا رَزَقْنَاكُمْ وَاشْكُرُوا لِلَّهِ إِنْ كُنْتُمْ إِيَّاهُ تَعْبُدُون' ",
    mosnad: "الاية : 172",
    hokm: "البقرة",
  ),
  ahadit(
    hadit:
        "قال تعالى : 'شَهْرُ رَمَضَانَ الَّذِي أُنْزِلَ فِيهِ الْقُرْآنُ هُدًى لِلنَّاسِ وَبَيِّنَاتٍ مِنَ الْهُدَى وَالْفُرْقَانِ فَمَنْ شَهِدَ مِنْكُمُ الشَّهْرَ فَلْيَصُمْهُ وَمَنْ كَانَ مَرِيضًا أَوْ عَلَى سَفَرٍ فَعِدَّةٌ مِنْ أَيَّامٍ أُخَرَ يُرِيدُ اللَّهُ بِكُمُ الْيُسْرَ وَلَا يُرِيدُ بِكُمُ الْعُسْرَ وَلِتُكْمِلُوا الْعِدَّةَ وَلِتُكَبِّرُوا اللَّهَ عَلَى مَا هَدَاكُمْ وَلَعَلَّكُمْ تَشْكُرُون'",
    mosnad: "الاية : 185",
    hokm: "البقرة",
  ),
  ahadit(
    hadit:
        "قال تعالى : 'مَا يَفْعَلُ اللَّهُ بِعَذَابِكُمْ إِنْ شَكَرْتُمْ وَآمَنْتُمْ وَكَانَ اللَّهُ شَاكِرًا عَلِيمًا'",
    mosnad: "الاية : 147",
    hokm: "النساء",
  ),
  ahadit(
    hadit:
        " قال تعالى : 'لَقَدْ أَرْسَلْنَا مُوسَى بِآيَاتِنَا أَنْ أَخْرِجْ قَوْمَكَ مِنَ الظُّلُمَاتِ إِلَى النُّورِ وَذَكِّرْهُمْ بِأَيَّامِ اللَّهِ إِنَّ فِي ذَلِكَ لَآيَاتٍ لِكُلِّ صَبَّارٍ شَكُورٍ * وَإِذْ قَالَ مُوسَى لِقَوْمِهِ اذْكُرُوا نِعْمَةَ اللَّهِ عَلَيْكُمْ إِذْ أَنْجَاكُمْ مِنْ آلِ فِرْعَوْنَ يَسُومُونَكُمْ سُوءَ الْعَذَابِ وَيُذَبِّحُونَ أَبْنَاءَكُمْ وَيَسْتَحْيُونَ نِسَاءَكُمْ وَفِي ذَلِكُمْ بَلَاءٌ مِنْ رَبِّكُمْ عَظِيمٌ * وَإِذْ تَأَذَّنَ رَبُّكُمْ لَئِنْ شَكَرْتُمْ لَأَزِيدَنَّكُمْ وَلَئِنْ كَفَرْتُمْ إِنَّ عَذَابِي لَشَدِيد' ",
    mosnad: "الاية : 5-7",
    hokm: "ابراهيم",
  ),
  ahadit(
    hadit:
        "قال تعالى : 'إِنَّمَا تَعْبُدُونَ مِنْ دُونِ اللَّهِ أَوْثَانًا وَتَخْلُقُونَ إِفْكًا إِنَّ الَّذِينَ تَعْبُدُونَ مِنْ دُونِ اللَّهِ لَا يَمْلِكُونَ لَكُمْ رِزْقًا فَابْتَغُوا عِنْدَ اللَّهِ الرِّزْقَ وَاعْبُدُوهُ وَاشْكُرُوا لَهُ إِلَيْهِ تُرْجَعُون'",
    mosnad: "الاية : 17",
    hokm: "العنكبوت",
  ),
  ahadit(
    hadit:
        "وَلَقَدْ آتَيْنَا لُقْمَانَ الْحِكْمَةَ أَنِ اشْكُرْ لِلَّهِ وَمَنْ يَشْكُرْ فَإِنَّمَا يَشْكُرُ لِنَفْسِهِ وَمَنْ كَفَرَ فَإِنَّ اللَّهَ غَنِيٌّ حَمِيد",
    mosnad: "الاية :12",
    hokm: "لقمان",
  ),
];
List<ahadit> saada = [
  ahadit(
    hadit:
        "قال تعالى : 'وَأَمَّا الَّذِينَ سُعِدُوا فَفِي الْجَنَّةِ خَالِدِينَ فِيهَا مَا دَامَتِ السَّمَاوَاتُ وَالْأَرْضُ إِلَّا مَا شَاءَ رَبُّكَ عَطَاءً غَيْرَ مَجْذُوذٍ'",
    mosnad: "الاية : 108",
    hokm: "هود",
  ),
  ahadit(
    hadit:
        "قال تعالى : 'يا أَيُّهَا النّاسُ قَد جاءَتكُم مَوعِظَةٌ مِن رَبِّكُم وَشِفاءٌ لِما فِي الصُّدورِ وَهُدًى وَرَحمَةٌ لِلمُؤمِنينَ* قُلْ بِفَضْلِ اللَّهِ وَبِرَحْمَتِهِ فَبِذَٰلِكَ فَلْيَفْرَحُوا هُوَ خَيْرٌ مِّمَّا يَجْمَعُونَ'",
    mosnad: "الاية :57-58",
    hokm: "يونس",
  ),
  ahadit(
    hadit:
        "قال تعالى : 'غُلِبَتِ الرُّومُ* فِي أَدْنَى الْأَرْضِ وَهُم مِّن بَعْدِ غَلَبِهِمْ سَيَغْلِبُونَ* فِي بِضْعِ سِنِينَ ۗ لِلَّهِ الْأَمْرُ مِن قَبْلُ وَمِن بَعْدُ ۚ وَيَوْمَئِذٍ يَفْرَحُ الْمُؤْمِنُونَ* بِنَصْرِ اللَّهِ ۚ يَنصُرُ مَن يَشَاءُ ۖ وَهُوَ الْعَزِيزُ الرَّحِيمُ'",
    mosnad: "الاية : 2-6",
    hokm: "الروم",
  ),
  ahadit(
    hadit: "",
    mosnad: "",
    hokm: "",
  ),
  ahadit(
    hadit: "",
    mosnad: "",
    hokm: "",
  ),
  ahadit(
    hadit: "",
    mosnad: "",
    hokm: "",
  ),
  ahadit(
    hadit: "",
    mosnad: "",
    hokm: "",
  ),
  ahadit(
    hadit: "",
    mosnad: "",
    hokm: "",
  ),
  ahadit(
    hadit: "",
    mosnad: "",
    hokm: "",
  ),
  ahadit(
    hadit: "",
    mosnad: "",
    hokm: "",
  ),
  ahadit(
    hadit: "",
    mosnad: "",
    hokm: "",
  ),
  ahadit(
    hadit: "",
    mosnad: "",
    hokm: "",
  ),
  ahadit(
    hadit: "",
    mosnad: "",
    hokm: "",
  ),
  ahadit(
    hadit: "",
    mosnad: "",
    hokm: "",
  ),
  ahadit(
    hadit: "",
    mosnad: "",
    hokm: "",
  ),
  ahadit(
    hadit: "",
    mosnad: "",
    hokm: "",
  ),
  ahadit(
    hadit: "",
    mosnad: "",
    hokm: "",
  ),
  ahadit(
    hadit: "",
    mosnad: "",
    hokm: "",
  ),
];
