class NamesAndMeans {
  final String Names;
  final String means;
  NamesAndMeans({required this.Names, required this.means});
}

List<NamesAndMeans> AllahNames = [
  NamesAndMeans(
    Names: "الله",
    means:
        " اسم الذات المختص به جل شأنه، لا يتسمى به غيره، فهو علم على المعبود بحق، الذي تعنو له السموات والأرض وما بينها، ونحن نرفض إطلاق أي اسم على الذات الأقدس غير لفظ “الله” وحده هو العلم الحقيقي ",
  ),
  NamesAndMeans(
    Names: "الرَّحْمن",
    means:
        "من أسماء الله الحسنى، ومعنى الرحمة معروف، والاسم الأول مختص كذلك بالله سبحانه فلا يوصف به غيره “قل ادعوا الله أو ادعوا الرحمن” \n(الإسراء: 110) وهذه الصيغة في اللغة تعني بلوغ الصفة تمامها أما الرحيم فالصيغة تعني فيضان الوصف ليشمل الآخرين فالذات العليا ممتلئة بالرحمة، وهذه الرحمة تعم الغير، وتشمل كل شيء",
  ),
  NamesAndMeans(
    Names: "الرَّحِيم",
    means:
        "من أسماء الله الحسنى، ومعنى الرحمة معروف، والاسم الأول مختص كذلك بالله سبحانه فلا يوصف به غيره “قل ادعوا الله أو ادعوا الرحمن” \n(الإسراء: 110) وهذه الصيغة في اللغة تعني بلوغ الصفة تمامها أما الرحيم فالصيغة تعني فيضان الوصف ليشمل الآخرين فالذات العليا ممتلئة بالرحمة، وهذه الرحمة تعم الغير، وتشمل كل شيء",
  ),
  NamesAndMeans(
    Names: "المَلِك",
    means:
        "إِن كُلُّ مَن فِی ٱلسَّمَـٰوَ ٰ⁠تِ وَٱلۡأَرۡضِ إِلَّاۤ ءَاتِی ٱلرَّحۡمَـٰنِ عَبۡدࣰا” (مريم: 93). “ولله يسجد من في السموات والأرض طوعًا وكرها” (الرعد: 15)",
  ),
  NamesAndMeans(
    Names: "الْقُدُّوس",
    means:
        "المطهر من كل عيب، المنزه عن كل نقص، ومحور التسبيح يدور على هذا المعنى، سبحانه وتعالى",
  ),
  NamesAndMeans(
    Names: "السَّلَام",
    means: "الذي لا يجيئ من قبله عدوان، بل يرتقب الخير والرضا",
  ),
  NamesAndMeans(
    Names: "المُؤْمِن",
    means:
        "الذي يذهب القلق والخوف ويمنح الطمأنينه والأمان “الذي أطعمهم من جوع وآمنهم من خوف",
  ),
  NamesAndMeans(
    Names: "الْمُهَيْمِن",
    means:
        "الذي لا يغيب عن سلطانه شيء، فهو يرقب ملكوته كله رقابة استيعاب وشهود",
  ),
  NamesAndMeans(
    Names: "الْعَزِيز",
    means:
        "الغالب فلا يغلب، والذي يجير ولا يجار عليه، “من كان يريد العزة فلله العزة جميعًا” (فاطر: 10)",
  ),
  NamesAndMeans(
    Names: "الْجَبَّار",
    means:
        "العلي فوق الخلائق كلها، وفارض قضائه وقدره على كل شيء “ألا له الخلق والأمر” (الاعراف: 54)",
  ),
  NamesAndMeans(
    Names: "الْمُتَكَبِّر",
    means:
        "المتعالي على صفات الخلق لا يتنزل إليها، والتاء في هذه الصيغة للانفراد والتخصص، لا للتكلف، من الكبرياء بمعنى العظمة التي هي حق الله، ومن نازعه هذا الحق من جبابرة الأرض قصمه",
  ),
  NamesAndMeans(
    Names: "الْخَالِق",
    means:
        "موجد الكون من عدم، ولا يقدر أحد على الإيجاد من عدم “أَفَمَن يَخْلُقُ كَمَن لَّا يَخْلُقُ” (النحل: 17)",
  ),
  NamesAndMeans(
    Names: "الْبَارِئ",
    means:
        "الخالق ويغلب أن تستعمل الكلمة في إيجاد الأحياء، فيقال: بارئ النسم أي الأرواح..",
  ),
  NamesAndMeans(
    Names: "الْمُصَوِّر",
    means:
        "منشئ الخلق على صور شتى “هو الذي يصوركم في الأرحام كيف يشاء” \n(آل عمران:6) وقلما تتفق ملامح الوجوه، مع كثرة الناس، ويكاد يستحيل اتفاق بصمات الأصابع، وهو سبحانه مصور خطوطهما..",
  ),
  NamesAndMeans(
    Names: "اَلْغَفَّار",
    means:
        "موجد الكون من عدم، ولا يقدر أحد على الإيجاد من عدم “أَفَمَن يَخْلُقُ كَمَن لَّا يَخْلُقُ” (النحل: 17)",
  ),
  NamesAndMeans(
    Names: "الْقَهَّار",
    means:
        "الذي تنفذ إرادته دون اعتراض! فيستحيل أن يردها بشر ولا ملك، وهو معطي الكواكب أحجامها ومعطي الرسل أقدارها ومكانتها، وإذا منح أو منع لم يجرؤ على رد مشيئته أحد “وإن يمسسك الله بضر فلا كاشف له إلا هو، وأن يمسسك بخير فهو على كل شيء قدير، وهو القاهر فوق عباده”",
  ),
  NamesAndMeans(
    Names: "الْوَهَّاب",
    means:
        "صاحب العطايا الجزيلة، تفضلاً منه على من شاء “وأن الفضل بيد الله يؤتيه من يشاء والله واسع عليم” (آل عمران: 73)",
  ),
  NamesAndMeans(
    Names: "الرَّزَّاق",
    means:
        "الذي يطعم ولا يطعم، ويسوق لكل حي ما يفتقر إليه، ويفعل ذلك عن سعة واقتدار “إن الله هو الرزاق ذو القوة المتين” (الذاريات: 58)",
  ),
  NamesAndMeans(
    Names: "الْفَتَّاح",
    means:
        "الذي يفتح أبواب الخير المادي والأدبي من رزق أو علم “ما يفتح الله للناس من رحمة فلا ممسك لها وما يمسك فلا مرسل له من بعده” (فاطر:2). “القابض الباسط”: هذه الصفات المتقابلة تشير إلى أفعال الله بين الناس حسب حكمته وإرادته “الله يبسط الرزق لمن يشاء من عباده ويقدر له إن الله بكل شيء عليم” (العنكبوت: 62)",
  ),
  NamesAndMeans(
    Names: "الْعَلِيم",
    means:
        "يعلم تفاصيل الأمور، ودقائق الأشياء، وخفايا الضمائر، والنفوس، لا يعزب عنه مثقال ذرة، فعلمه يحيط بجميع الأشياء",
  ),
  NamesAndMeans(
    Names: "الْقَابِضُ",
    means: "يقبض الرزق عمن يشاء من الخلق بعدله وحكمته",
  ),
  NamesAndMeans(
    Names: "الْبَاسِطُ",
    means: " يوسّعُ الرزق لمن يشاء من عباده بجوده ورحمته",
  ),
  NamesAndMeans(
    Names: "الخَافِض",
    means: "خفض كل من طغى وتجبر وخرج على شريعته وتمرّد",
  ),
  NamesAndMeans(
    Names: "الرَّافِعُ",
    means:
        "يرفع عباده المؤمنين بالطاعات، ويرفعهم على عدوهم فينصرهم، وهو رافع السماوات السبع",
  ),
  NamesAndMeans(
    Names: "المُعِز",
    means: "يهب القوة والغلبة والشدة لمن شاء فيعزه",
  ),
  NamesAndMeans(
    Names: "المُذِل",
    means: "ينزع القوة والغلبة والشّدة عمن يشاء فيذله",
  ),
  NamesAndMeans(
    Names: "السَّمِيعُ",
    means:
        " سمعه لجميع الأصوات الظاهرة والباطنة الخفية والجلية، وإحاطته التامة بها، وسمع السائلين والداعين والعابدين، ويجيبهم ويثيبهم",
  ),
  NamesAndMeans(
    Names: "الْبَصِير",
    means: "يرى الأشياء كلها ظاهرها وباطنها، المحيط بكل شيء علمًا",
  ),
  NamesAndMeans(
    Names: "الْحَكَم",
    means:
        "يفصل بين مخلوقاته بما شاء، ويفصل بين الحق والباطل، لا راد لقضائه، ولا معقب لحكمه",
  ),
  NamesAndMeans(
    Names: "العَدْل",
    means:
        "حرَّم الظلم على نفسه، وجعله على عباده محرما، فهو المنزه عن الظلم والجور في أحكامه وأفعاله، يعطي كل ذي حق حقه",
  ),
  NamesAndMeans(
    Names: "اللَّطِيفُ",
    means: "الرفيق بعباده، يرزق وييسر ويحسن إليهم، ويرفق بهم ويتفضل عليهم",
  ),
  NamesAndMeans(
    Names: "الْخَبِيرُ",
    means:
        "العليم بدقائق الأمور، لا تخفى عليه خافية، ولا يغيب عن علمه شيء، العالم بما كان ويكون",
  ),
  NamesAndMeans(
    Names: "الْحَلِيمُ",
    means:
        "يمهل ولا يهمل، ويستر الذنوب، ويؤخر العقوبة، فيرزق العاصي كما يرزق المطيع",
  ),
  NamesAndMeans(
    Names: "الْعَظِيمُ",
    means:
        "العظيم في كل شيء، عظيم في ذاته وأسمائه وصفاته، فلا أحد يساويه، ولا عظيم يدانيه",
  ),
  NamesAndMeans(
    Names: "الْغَفُورُ",
    means:
        "الساتر لذنوب عباده المتجاوز عن خطاياهم وذنوبهم، الفرق بين هذا الاسم واسم الغفار: أنّ اسم الغفور يكون للدلالة على مغفرة الذنب مهما عظم وأيس صاحبه من المغفرة، أمّا الغفار فتدل على مغفرة الله المستمرة للذنوب المختلفة لأن الإنسان خطاء فالله غفار",
  ),
  NamesAndMeans(
    Names: "الشَّكُورُ",
    means: "يزكو عنده القليل من أعمال العباد، فيتقبلها ويضاعف أجرها",
  ),
  NamesAndMeans(
    Names: "الْعَلِيُّ",
    means:
        " الرفيع القدر فلا يحيط به وصف الواصفين، المتعالي عن الأنداد والأضداد، فكل معاني العلو ثابتة له ذاتًا وقهرًا وشأنًا",
  ),
  NamesAndMeans(
    Names: "الْكَبِيرُ",
    means:
        "العظيم الجليل ذو الكبرياء في صفاته وأفعاله، فلا يحتاج إلى شيء، ولا يعجزه شيء",
  ),
  NamesAndMeans(
    Names: "الْحَفِيظُ",
    means:
        "لا يغرب عن حفظه شيء ولو كمثقال الذر، فحفظه لا يتبدل ولا يزول ولا يعتريه التبديل",
  ),
  NamesAndMeans(
    Names: "المُقِيت",
    means:
        "المتكفل بإيصال أقوات الخلق إليهم، وهو الحفيظ والمقتدر والقدير والمقدر والممدد",
  ),
  NamesAndMeans(
    Names: "الْحَسِيبُ",
    means: "الكافي الذي منه كفاية العباد، عليه الاعتماد يكفي العباد بفضله",
  ),
  NamesAndMeans(
    Names: "الجَلِيل",
    means:
        "العظيم المطلق المتصف بجميع صفات الكمال، والمنعوت بكمالها، المنزه عن كل نقص",
  ),
  NamesAndMeans(
    Names: "الْكَرِيمُ",
    means:
        "الكثير الخير، الجواد المعطي الذي لا ينفد عطاؤه، وهو الكريم المطلق، الجامع لأنواع الخير والشرف والفضائل، المحمود بفعاله",
  ),
  NamesAndMeans(
    Names: "الرَّقِيبُ",
    means:
        "يراقب أحوال العباد، ويعلم أقوالهم، ويحصي أعمالهم، وهو الحافظ الذي لا يغيب عنه شيء",
  ),
  NamesAndMeans(
    Names: "الْمُجِيبُ",
    means:
        "يجيب دعاء من دعاه، وسؤال من سأله، ويقابله بالعطاء والقبول، ولا يُسأل أحد سواه",
  ),
  NamesAndMeans(
    Names: "الْوَاسِعُ",
    means: "وسع رزقه جميع خلقه، وسعت رحمته كل شيء، المحيط بكل شيء",
  ),
  NamesAndMeans(
    Names: "اَلْحَكِيمُ",
    means:
        "المُحق في تدبيره، اللطيف في تقديره، الخبير بحقائق الأمور، العليم بحكمه المقدور في جميع خلقه، وقضاءه خير وحكمه وعدل",
  ),
  NamesAndMeans(
    Names: "الْوَدُودُ",
    means: "المحب لعباده، والمحبوب في قلوب أوليائه",
  ),
  NamesAndMeans(
    Names: "الْمَجِيدُ",
    means:
        "تمجَّد بفعاله، ومجَّده خلقه لعظمته، والمجيد هو واسع الكرم، ووصف نفسه بالمجيد وهو متضمن كثرة صفات كماله وسعتها، وعدم إحصاء الخلق لها، وسعة أفعاله وكثرة خيره ودوامه، وتعني أيضاً البالغ النهاية في المجد، الكثير الإحسان الجزيل العطاء العظيم البر",
  ),
  NamesAndMeans(
    Names: "البَاعِث",
    means:
        "باعث الخلق يوم القيامة، وباعث رسله إلى العباد، وباعث المعونة إلى العبد",
  ),
  NamesAndMeans(
    Names: "الشَّهِيدُ",
    means:
        "الحاضر الذي لا يغيب عنه شيء، فهو المطلع على كل شيء مشاهد له عليم بتفاصيله",
  ),
  NamesAndMeans(
    Names: "الْحَقُّ",
    means: "يحق الحق بكلماته، ويؤيد أولياءه، فهو المستحق للعبادة",
  ),
  NamesAndMeans(
    Names: "الْوَكِيلُ",
    means:
        "الكفيل بالخلق القائم بأمورهم، فمن توكل عليه تولاه وكفاه، ومن استغنى به أغناه وأرضاه",
  ),
  NamesAndMeans(
    Names: "الْقَوِيّ",
    means:
        "صاحب القدرة التامة البالغة الكمال، غالب لا يُغلب فقوته فوق كل قوة، ولا يرد قضاءه راد، ينفذ أمره، ويمضي قضاؤه في خلقه، شديد عقابه لمن كفر بآياته وجحد حججه",
  ),
  NamesAndMeans(
    Names: "الْمَتِينُ",
    means:
        " الشديد الذي لا يحتاج في إمضاء حكمه إلى جند أو مدد ولا معين، فهو المتناهي في القوة، لا تلحق أفعاله مشقة، ولا يمسه فيها لغوب",
  ),
  NamesAndMeans(
    Names: "الْوَلِيُّ",
    means:
        "المحب الناصر لمن أطاعه، ينصر أولياءه، ويقهر أعداءه، والمتولي لأمور الخلائق",
  ),
  NamesAndMeans(
    Names: "الْحَمِيدُ",
    means: "المستحق للحمد والثناء؛ على ذاته وصفاته وعلى نعمه التي لا تحصى",
  ),
  NamesAndMeans(
    Names: "الْـمُحْصِي",
    means: "أحصى كل شيء بعلمه، فلا يفوته منها دقيق ولا جليل",
  ),
  NamesAndMeans(
    Names: "المُبدِئ",
    means: " أنشأ الأشياء، واخترعها ابتداء من غير سابق مثال",
  ),
  NamesAndMeans(
    Names: "المُعِيد",
    means:
        " يعيد الخلق بعد الحياة إلى الممات في الدنيا، وبعد الممات إلى الحياة يوم القيامة",
  ),
  NamesAndMeans(
    Names: "المُحيِي",
    means:
        "خالق الحياة ومعطيها لمن شاء، يحيي الخلق من العدم ثم يحييهم بعد الموت",
  ),
  NamesAndMeans(
    Names: "المُمِيت",
    means:
        "مقدر الموت على كل من أماته ولا مميت سواه، قهر عباده بالموت متى شاء وكيف شاء",
  ),
  NamesAndMeans(
    Names: "الْحَيُّ",
    means:
        " المتصف بالحياة الأبدية التي لا بداية لها ولا نهاية، الباقي أزلًا وأبدًا، الحيّ الذي لا يموت",
  ),
  NamesAndMeans(
    Names: "الْقَيُّومُ",
    means:
        "القائم بنفسه، الغني عن غيره، القائم بتدبير أمر خلقه في إنشائهم ورزقهم",
  ),
  NamesAndMeans(
    Names: "الوَاجِد",
    means: "لا يعوزه شيء ولا يعجزه شيء، يجد كل ما يطلبه، ويدرك كل ما يريده",
  ),
  NamesAndMeans(
    Names: "المَاجِد",
    means:
        "له الكمال المتناهي والعز الباهي، له العز في الأوصاف والأفعال، يعامل العباد بالجود",
  ),
  NamesAndMeans(
    Names: "الْوَاحِدُ",
    means:
        "الفرد المتفرد في ذاته وصفاته وأفعاله، واحد في ملكه لا ينازعه أحد، لا شريك له سبحانه",
  ),
  NamesAndMeans(
    Names: "الأَحَد",
    means:
        "الذي تفرد بكل كمال ومجد وجلال وجمال وحمد وحكمة ورحمة وغيرها من صفات الكمال، فليس له فيها مثيل ولا نظير ولا مناسب بوجه من الوجوه",
  ),
  NamesAndMeans(
    Names: "الصَّمَدُ",
    means:
        "المطاع لا يقضى دونه أمر، يُقصد إليه في الحوائج، مقصد عباده في مهمات دينهم ودنياهم",
  ),
  NamesAndMeans(
    Names: "الْقَادِرُ",
    means:
        "يقدر على إيجاد المعدوم وإعدام الموجود على قدر ما تقتضي الحكمة، لا زائدًا عليه ولا ناقصًا عنه",
  ),
  NamesAndMeans(
    Names: "الْمُقْتَدِرُ",
    means: "يقدر على إصلاح الخلائق على وجه لا يقدر عليه غيره",
  ),
  NamesAndMeans(
    Names: "الْمُقَدِّمُ",
    means: "يقدم الأشياء ويضعها في مواضعها، فمن استحق التقديم قدمه",
  ),
  NamesAndMeans(
    Names: "الْمُؤَخِّرُ",
    means:
        "يؤخر الأشياء فيضعها في مواضعها، المؤخر لمن شاء من الفجار والكفار وكل من يستحق التأخير",
  ),
  NamesAndMeans(
    Names: "الْأَوَّلُ",
    means: "لم يسبقه في الوجود شيء، فهو أول قبل الوجود",
  ),
  NamesAndMeans(
    Names: "الْآخِرُ",
    means:
        "الباقي بعد فناء خلقه، البقاء الأبدي، يفنى الكل وله البقاء وحده، فليس بعده شيء",
  ),
  NamesAndMeans(
    Names: "الظَّاهِرُ",
    means: "ظهر فوق كل شيء وعلا عليه، الظاهر وجوده لكثرة دلائله",
  ),
  NamesAndMeans(
    Names: "الْبَاطِنُ",
    means: "العالم ببواطن الأمور وخفاياها، وهو أقرب إلينا من حبل الوريد",
  ),
  NamesAndMeans(
    Names: "الوَالِي",
    means:
        "المالك للأشياء المتصرف فيها بمشيئته وحكمته، ينفذ فيها أمره، ويجري عليها حكمه",
  ),
  NamesAndMeans(
    Names: "الْمُتَعَالِ",
    means: "جلّ عن إفك المفترين، وتنزه عن وساوس المتحيرين",
  ),
  NamesAndMeans(
    Names: "الْبِرُّ",
    means:
        "العطوف على عباده ببره ولطفه، مَنَّ على السائلين بحسن عطائه، وصدقهم فيما وعد",
  ),
  NamesAndMeans(
    Names: "التَّوَّابُ",
    means:
        "يوفق عباده للتوبة حتى يتوب عليهم، ويقبل توبتهم فيقابل الدعاء بالعطاء، والتوبة بالغفران",
  ),
  NamesAndMeans(
    Names: "الْمُنْتَقِمُ",
    means:
        "يقصم ظهور الطغاة، ويشدد العقوبة على العصاة، وذلك بعد الإعذار والإنذار",
  ),
  NamesAndMeans(
    Names: "العَفُو",
    means:
        "يترك المؤاخذة على الذنوب ولا يذكرك بالعيوب، فهو يمحو السيئات ويتجاوز عن المعاصي",
  ),
  NamesAndMeans(
    Names: "الرَّؤُوفُ",
    means:
        "المتعطف على المذنبين بالتوبة، جادَ بلطفه ومَنّ بتعطفه، يستر العيوب ثم يعفو عنها",
  ),
  NamesAndMeans(
    Names: "مَالِكُ الْمُلْكِ",
    means: "المتصرف في ملكه كيف يشاء لا رادّ لحكمه، ولا معقب لأمره",
  ),
  NamesAndMeans(
    Names: "ذُو الْجَلَالِ والْإكْرَامِ",
    means:
        "المنفرد بصفات الجلال والكمال والعظمة، المختص بالإكرام والكرامة وهو أهل لأن يُجلّ",
  ),
  NamesAndMeans(
    Names: "المُقسِّط",
    means:
        "العادل في حكمه، الذي ينتصف للمظلوم من الظالم، ثم يكمل عدله فيرضي الظالم بعد إرضاء المظلوم",
  ),
  NamesAndMeans(
    Names: "الْجَامِعُ",
    means:
        "جمع الكمالات كلها، ذاتًا ووصفًا وفعلًا، يجمع بين الخلائق المتماثلة والمتباينة، ويجمع الأولين والآخرين",
  ),
  NamesAndMeans(
    Names: "الْغَنِيُّ",
    means:
        " لا يحتاج إلى شيء، وهو المستغني عن كل ما سواه، المفتقر إليه كل من عاداه",
  ),
  NamesAndMeans(
    Names: "المُغنِي",
    means: "معطي الغنى لعباده، يغني من يشاء غناه، وهو الكافي لمن شاء من عباده",
  ),
  NamesAndMeans(
    Names: "الْمُعْطِي",
    means: "أعطى كل شيء",
  ),
  NamesAndMeans(
    Names: "المَانِع",
    means: "يمنع العطاء عمّن يشاء ابتلاءً أو حماية",
  ),
  NamesAndMeans(
    Names: "الضَّار",
    means: "المقدر للضّر على من أراد كيف أراد",
  ),
  NamesAndMeans(
    Names: "النَّافِع",
    means: " المقدر النفع والخير لمن أراد كيف أراد",
  ),
  NamesAndMeans(
    Names: "النُّورُ",
    means:
        "الهادي الرشيد الذي يرشد بهدايته من يشاء فيبين له الحق، ويلهمه اتباعه، الظاهر في ذاته، المظهر لغيره",
  ),
  NamesAndMeans(
    Names: "الْهَادِي",
    means:
        "المبين للخلق طريق الحق بكلامه، يهدي القلوب إلى معرفته، والنفوس إلى طاعته",
  ),
  NamesAndMeans(
    Names: "الْبَدِيعُ",
    means:
        " لا يماثله أحد في صفاته، ولا في حكم من أحكامه، أو أمر من أموره، فهو المحدث الموجد على غير مثال",
  ),
  NamesAndMeans(
    Names: "الباقي",
    means:
        "وحده له البقاء، الدائم الوجود الموصوف بالبقاء الأزلي، غير قابل للفناء فهو الباقي بلا انتهاء",
  ),
  NamesAndMeans(
    Names: "الْوَارِثُ",
    means:
        "الأبقى الدائم الذي يرث الخلائق بعد فناء الخلق، وهو يرث الأرض ومن عليها",
  ),
  NamesAndMeans(
    Names: "الرَّشِيد",
    means: "أسعد من شاء بإرشاده، وأشقى من شاء بإبعاده، عظيم الحكمة بالغ الرشاد",
  ),
  NamesAndMeans(
    Names: "الصَّبُور",
    means:
        " الحليم الذي لا يعاجل العصاة بالنقمة، بل يعفوا ويؤخر، ولا يسرع بالفعل قبل أوانه",
  ),
];
